package com.soft.mcqbanglabook;

public class AmAirVepuQNA {


    public static String myQuestion[] ={
            "১. বিভূতিভূষণ বন্দ্যোপাধ্যায় কত সালে জন্মগ্রহণ করেন?",
            "২. বিভূতিভূষণ বন্দ্যোপাধ্যায়ের জন্মস্থান কোথায়?",
            "৩. বিভূতিভূষণ বন্দ্যোপাধ্যায়ের পিতার নাম কী?",
            "৪. বিভূতিভূষণ বন্দ্যোপাধ্যায়ের মায়ের নাম কী?",
            "৫. বাংলার জনপ্রিয় কথাশিল্পী হিসেবে কার পরেই বিভূতিভূষণ বন্দ্যোপাধ্যায়ের নাম উচ্চারিত হয়?",
            "৬. বিভূতিভূষণ বন্দ্যোপাধ্যায় কোন প্রতিষ্ঠান থেকে বি.এ. ডিগ্রি লাভ করেন?",
            "৭. বিভূতিভূষণ বন্দ্যোপাধ্যায় কোন উপন্যাসের জন্য রবীন্দ্র-পুরস্কারে ভূষিত হন",
            "৮. কোনটি বিভূতিভূষণ বন্দ্যোপাধ্যায়ের উপন্যাস?",
            "৯. বিভূতিভূষণ বন্দ্যোপাধ্যায় কত সালে মৃত্যুবরণ করেন?",
            "১০. হরিহরের পুত্র কখন বারান্দায় বসে খেলা করছিল?",
            "১১. ‘আম-আঁটির ভেঁপু’ গল্পে বর্ণিত হরিহরের পুত্রের নাম কী?",
            "১২. ‘আম-আঁটির ভেঁপু’ গল্পে ডালা ভাঙা টিনের বাক্সটি কার?",
            "১৩. অপু তার ডালা ভাঙা বাক্সের সমুদয় সম্পতি উপুড় করে মেঝেতে ঢেলেছে কেন?",
            "১৪. অপুর কাছে থাকা টিনের ভেঁপু-বাঁশিটির দাম কত?",
            "১৫. অপু তার কড়িগুলো কীভাবে পেয়েছিল?",
            "১৬. ‘আম-আঁটির ভেঁপু’ গল্পে অপুর খেলনা পিস্তলটির দাম কত?",
            "১৭. অপুকে শুকনো নাটাফল কে এনে দিয়েছে?",
            "১৮. ‘আম-আঁটির ভেঁপু’ গল্পে গঙ্গা যমুনা খেলতে কিসের লক্ষ্য অব্যর্থ বলে অপুর মনে হয়?",
            "১৯. অপু বারান্দায় বসে খেলার সময় উঠানের কাঁঠালতলা থেকে কে তাকে ডাক দেয়?",
            "২০. কাঁঠালতলা থেকে দুর্গা অপুকে ডাকার সময় তার স্বর সতর্কতা মিশ্রিত ছিল কেন?",
            "২১. ‘আম-আঁটির ভেঁপু’ গল্পে বর্ণিত দুর্গার বয়স কত?",
            "২২. ‘আম-আঁটির ভেঁপু’ গল্পে দুর্গার চোখ দুটিকে কার চোখের সাথে তুলনা করা হয়েছে?",
            "২৩. ‘আম-আঁটির ভেঁপু’ গল্পে দুর্গার হাতে কিসের চুড়ি ছিল?",
            "২৪. দুর্গার নারিকেলের মালায় কী ছিল?",
            "২৫. দুর্গা অপুকে তেল আর নুন নিয়ে আসতে বলল কেন?",
            "২৬. দুর্গা নারিকেলের মালার আমগুলো কুড়িয়ে আনে কোথা থেকে? ",
            "২৭. অপু বাসি কাপড়ে তেলের ভাঁড় ছুঁতে চায় না কেন?",
            "২৮. দুর্গাদের বাড়ি থেকে ভুবন মুখুয্যের বাড়ি কয় মিনিটের পথ?",
            "২৯. দুর্গাদের বাড়ির পাশের জঙ্গলাবৃত ভিটাটি কার?",
            "৩০. দুর্গার মায়ের নাম কী?"



    };




    public static String myChoices[][] = {

            {"ক. ১৮৭৪ সালে",  "খ. ১৮৮৪ সালে",  "গ. ১৮৯৪ সালে",  "ঘ. ১৯০৪ সালে"},
            {"ক. চব্বিশ পরগণা",  "খ. মেদিনীপুর",  "গ. হুগলি",  "ঘ. নদীয়া"},
            {"ক. হরিহর বন্দ্যোপাধ্যায়",  "খ. মহানন্দা বন্দ্যোপাধ্যায়",  "গ. রঙ্গলাল বন্দ্যোপাধ্যায়",  "ঘ. কৈলাশচন্দ্র বন্দ্যোপাধ্যায় "},
            {"ক. কুসুমকুমারী দেবী",  "খ. স্বর্ণকুমারী দেবী",  "গ. মৃণালিনী দেবী",  "ঘ. প্রমীলা দেবী"},
            {"ক. রবীন্দ্রনাথ ঠাকুর",  "খ. বঙ্কিমচন্দ্র চট্টোপাধ্যায়",  "গ. ঈশ্বরচন্দ্র বিদ্যাসাগর",  "ঘ. শরৎচন্দ্র চট্টোপাধ্যায়"},
            {"ক. কলকাতা বিশ্ববিদ্যালয়",  "খ. কলকাতা রিপন কলেজ",  "গ. আলীগড় বিশ্ববিদ্যালয়",  "ঘ. ফোর্ট উইলিয়াম কলেজ"},
            {"ক. পথের পাঁচালী",  "খ. অপরাজিত",  "গ. ইছামতি",  "ঘ. আরণ্যক"},
            {"ক. মেঘমল্লার",  "খ. মৌরীফুল",  "গ. যাত্রাবদল",  "ঘ. দৃষ্টিপ্রদীপ"},
            {"ক. ১৯৫০ সালে",  " খ. ১৯৫২ সালে",  "গ. ১৯৫৪ সালে",  "ঘ. ১৯৫৬ সালে"},
            {" ক. সকালে",  "খ. দুপুরে",  "গ. বিকেলে",  "ঘ. সন্ধ্যায়"},
            {" ক. তপু",  "খ. অপু",  "গ. বিধু",  "ঘ. তিনু"},
            {"ক. দুর্গার",  "খ. অপুর",  "গ. হরিহরের",  "ঘ. সর্বজয়ার"},
            {"ক. রাগ করে",  "খ. খেলা করার জন্য",  "গ. নতুন বাক্সে রাখার জন্য",  "ঘ. নতুন করে সাজানোর জন্য"},
            {"ক. এক পয়সা",  "খ. দুই পয়সা",  "গ. তিন পয়সা",  "ঘ. চার পয়সা"},
            {" ক. বাবা বাজার থেকে কিনে দিয়েছিল",  "খ. দুর্গামেলা থেকে এনে দিয়েছিল",  "গ. লক্ষীপূজার কড়ির চুপড়ি থেকে খুলে নিয়েছিল",  "ঘ. মা এনে দিয়েছিল"},
            {"ক. এক পয়সা",  "খ. দুই পয়সা",  "গ. তিন পয়সা",  "ঘ. চার পয়সা"},
            {"ক. হরিহর",  "খ. সর্বজয়া",  "গ. দুর্গা",  "ঘ. পটলি"},
            {" ক. কড়ি",  "খ. নাটাফল",  "গ. খাপরার কুচি",  "ঘ. খেলনা পিস্তলের গুলি"},
            {"ক. দুর্গা",  "খ. হরিহর",  "গ. সর্বজয়া",  "ঘ. পটলি"},
            {"ক. চুরি করে আম এনেছিল বলে",  "খ. মায়ের ভয়ে",  "গ. বাবার ভয়ে",  "ঘ. সাপ দেখেছিল বলে"},
            {"ক. ছয়-সাত বছর",  "খ. আট-নয় বছর",  "গ. দশ-এগারো বছর",  "ঘ. বারো-তেরো বছর"},
            {"ক. সর্বজয়ার চোখের সাথে",  "খ. হরিহরের চোখের সাথে",  "গ. অপুর চোখের সাথে",  "ঘ. পটলির চোখের সাথে"},
            {"ক. সোনার",  "খ. রুপার",  "গ. পিতলের",  "ঘ. কাচের"},
            {"ক. কচি আম",  "খ. পাকা আম",  "গ. নাটাফল",  "ঘ. পাকা লিচু"},
            {"ক. রান্না করার জন্য",  "খ. আমের কুসি জারাবার জন্য",  "গ. স্বর্ণ গোয়ালিনীকে দেওয়ার জন্য",  "ঘ. পুতুলের বিয়েতে রান্নার জন্য"},
            {"ক. মুখুয্যেবাড়ির বাগান থেকে",  "খ. পটলিদের সিঁদুর কৌটের আমতলা থেকে",  "গ. রায়বাড়ির গাছতলা থেকে",  "ঘ. নিজেদের আমবাগান থেকে"},
            {"ক. মায়ের ভয়ে",  "খ. বাবার ভয়ে",  "গ. অমঙ্গল হবে ভেবে",  "ঘ. দুর্গার ভয়ে"},
            {"ক. দুই মিনিটের",  "খ. তিন মিনিটের",  "গ. চার মিনিটের",  "ঘ. পাঁচ মিনিটের"},
            {"ক. ভুবন মুখুয্যের",  "খ. নীলমণি রায়ের",  "গ. স্বর্ণ গোয়ালিনীর",  "ঘ. অন্নদা রায়ের"},
            {"ক. সর্বজয়া",  "খ. স্বর্গদেবী",  "গ. লক্ষী",  "ঘ. অনুরাধা"}


    };




    public static String myCorrectAnswer[] = {

            "গ. ১৮৯৪ সালে",
            "ক. চব্বিশ পরগণা",
            "খ. মহানন্দা বন্দ্যোপাধ্যায়",
            "গ. মৃণালিনী দেবী",
            "ঘ. শরৎচন্দ্র চট্টোপাধ্যায়",
            "খ. কলকাতা রিপন কলেজ",
            "গ. ইছামতি",
            "ঘ. দৃষ্টিপ্রদীপ",
            "ক. ১৯৫০ সালে",
            " ক. সকালে",
            "খ. অপু",
            "খ. অপুর",
            "খ. খেলা করার জন্য",
            "ঘ. চার পয়সা",
            "গ. লক্ষীপূজার কড়ির চুপড়ি থেকে খুলে নিয়েছিল",
            "খ. দুই পয়সা",
            "গ. দুর্গা",
            "গ. খাপরার কুচি",
            "ক. দুর্গা",
            "খ. মায়ের ভয়ে",
            "ঘ. বারো-তেরো বছর",
            "গ. অপুর চোখের সাথে",
            "ঘ. কাচের",
            "ক. কচি আম",
            "খ. আমের কুসি জারাবার জন্য",
            "খ. পটলিদের সিঁদুর কৌটের আমতলা থেকে",
            "ক. মায়ের ভয়ে",
            "ঘ. পাঁচ মিনিটের",
            "খ. নীলমণি রায়ের",
            "ক. সর্বজয়া"


    };


}
