package com.soft.mcqbanglabook;

public class AmrPoricoyQNA {


    public static String myQuestion[] ={
            "১. সৈয়দ শামসুল হক কত সালে জন্মগ্রহণ করেন?",
            "২. সৈয়দ শামসুল হক কোন জেলায় জন্মগ্রহণ করেন?",
            "৩. ‘আমার পরিচয়’ কবিতাটির রচয়িতা কে?",
            "৪. সৈয়দ শামসুল হক ম্যাট্রিক পাস করেন কোন স্কুল থেকে?",
            "৫. সৈয়দ শামসুল হক প্রথম দিকে পেশা হিসেবে কোনটি বেছে নেন?",
            "৬. কোনটি সৈয়দ শামসুল হকের নাটক? ",
            "৭. কোনটি সৈয়দ শামসুল হকের শিশুতোষ গ্রন্থ?",
            "৮. ‘আমার পরিচয় ও বিদ্রোহীগণ’ সৈয়দ শামসুল হকের কী ধরনের রচনা? ",
            "৯. ‘আমার পরিচয়’ কবিতায় কবি কোথায় জন্মেছেন বলে উল্লেখ রয়েছে?",
            "১০. ‘আমার পরিচয়’ কবিতার কবি কোন ভাষায় কথা বলেন?",
            "১১. ‘আমার পরিচয়’ কবিতায় কবি বাংলার আলপথ দিয়ে কত বছর চলেন?",
            "১২. ‘আমার পরিচয়’ কবিতায় কবি পলিমাটি কোমলে কীভাবে চলেন? ",
            "১৩. তেরোশত নদী কবিকে কী শুধায়? ",
            "১৪. ‘আমার পরিচয়’ কবিতার কবি চর্যাপদের কী থেকে এসেছেন?",
            "১৫. কবি কার ডিঙার বহর থেকে এসেছেন?",
            "১৬. কবি কোন বিদ্রোহী গ্রাম থেকে আসার কথা বলেছেন? ",
            "১৭. কবি কোন যুগের চিত্রকলা থেকে এসেছেন? ",
            "১৮. ‘আমার পরিচয়’ কবিতায় বাঙালি কোন বৌদ্ধবিহার থেকে এসেছে বলে উল্লেখ আছে?",
            "১৯. ‘আমার পরিচয়’ কবিতায় বাঙালি বরেন্দ্রভূমির কী থেকে এসেছে বলে উল্লেখ আছে?",
            "২০. ‘আমার পরিচয়’ কবিতায় কাদের সার্বভৌম বলা হয়েছে? ",
            "২১. ‘আমার পরিচয়’ কবিতায় বাঙালি জাতির কোন বীজমন্ত্রটির কথা বলা হয়েছে?",
            "২২. ‘আমার পরিচয়’ কবিতায় ব্যবহৃত ‘আলপথ’ শব্দের অর্থ কী?",
            "২৩. বাংলা ভাষা ও সাহিত্য-ঐতিহ্যের প্রথম নিদর্শন কী?",
            "২৪. চর্যাপদের পাণ্ডুলিপি উদ্ধার করেন কে?",
            "২৫. চর্যাপদের পাণ্ডুলিপি কোন দেশ থেকে উদ্ধার করা হয়? ",
            "২৬. চর্যাপদ কখন রচিত হয়?",
            "২৭. প্রাচীন বাংলার অতি সাধারণ মানুষের প্রাণময় জীবনচিত্র ফুটে উঠেছে কোনটিতে?",
            "২৮. ‘আমার পরিচয়’ কবিতায় কবি সওদাগরের ডিঙার বহর বলতে কী বুঝিয়েছেন?",
            "২৯. চাঁদ সওদাগরের বাণিজ্যের কথা আছে কিসে?",
            "৩০. কৈবর্ত বিদ্রোহের নেতা ছিলেন কে?"



    };


    public static String myChoices[][] = {

            {"[ক] ১৯২৫ সালে",  "[খ] ১৯৩০ সালে",  "[গ] ১৯৩৫ সালে",  "[ঘ] ১৯৪০ সালে"},
            {"[ক] পাবনা",  "[খ] বরিশাল",  "[গ] রংপুর",  "[ঘ] কুড়িগ্রাম"},
            {"[ক] কাজী নজরুল ইসলাম",  "[খ] সৈয়দ শামসুল হক",  "[গ] নির্মলেন্দু গুণ",  "[ঘ] শামসুর রাহমান"},
            {"[ক] কুড়িগ্রাম সরকারি উচ্চ বিদ্যালয়",  "[খ] ঢাকা কলেজিয়েট স্কুল",  "[গ] ল্যাবরেটরি হাই স্কুল",  "[ঘ] মতিঝিল আইডিয়াল স্কুল"},
            {"[ক] শিক্ষকতা",  "[খ] অধ্যাপনা",  "[গ] আইন ব্যবসায়",  "[ঘ] সাংবাদিকতা"},
            {"[ক] পায়ের আওয়াজ পাওয়া যায়",  "[খ] রক্ত গোলাপ",  "[গ] আনন্দের মৃত্যু",  "[ঘ] একদা এক রাজ্যে"},
            {"[ক] শীত বিকেল",  "[খ] সীমান্তের সিংহাসন",  "[গ] আনন্দের মৃত্যু",  "[ঘ] আমার পরিচয় ও বিদ্রোহীগণ"},
            {"[ক] কবিতা",  "[খ] গল্প",  "[গ] নাটক",  "[ঘ] উপন্যাস"},
            {"[ক] বাংলাদেশে",  "[খ] ইংল্যান্ডে",  "[গ] জাপানে",  "[ঘ] চীনে"},
            {"[ক] বাংলায়",  "[খ] উর্দুতে",  "[গ] আরবিতে",  "[ঘ] ইংরেজিতে"},
            {"[ক] একশত বছর",  "[খ] তেরোশত বছর",  "[গ] হাজার বছর",  ""},
            {"[ক] ধীরগতিতে",  "[খ] খুব দ্রুত",  "[গ] চলার চিহ্ন ফেলে",  "[ঘ] চলার চিহ্ন লুকিয়ে"},
            {"[ক] কোথা থেকে তুমি এলে?",  "[খ] তোমার নাম কী?",  "[গ] তুমি কোথায় এসেছ?",  "[ঘ] তুমি কীভাবে এলে?"},
            {"[ক] অক্ষর",  "[খ] ছন্দ",  "[গ] ভাব",  "[ঘ] আবৃত্তি"},
            {"[ক] মাঝির",  "[খ] নাবিকের",  "[গ] সওদাগরের",  "[ঘ] জেলের"},
            {"[ক] কৈবর্তের",  "[খ] পাল যুগের",  "[গ] তিতুমীরের",  "[ঘ] সাঁওতালদের"},
            {"[ক] সেন যুগের",  "[খ] পাল যুগের",  "[গ] গুপ্ত যুগের",  "[ঘ] মৌর্য যুগের"},
            {"[ক] পাহাড়পুর",  "[খ] নালন্দা",  "[গ] ময়নামতি",  "[ঘ] তক্ষশিলা"},
            {"[ক] বৌদ্ধবিহার",  "[খ] সোনামসজিদ",  "[গ] জাদুঘর",  "[ঘ] পলিমাটি"},
            {"[ক] পাল রাজাদের",  "[খ] মুঘলদের",  "[গ] বারভূঁইয়াদের",  "[ঘ] সেনদের"},
            {"[ক] মানুষ মানুষের জন্য",  "[খ] এবারের সংগ্রাম স্বাধীনতার সংগ্রাম",  "[গ] আমরা বাঙালি, আমরা এক জাতি",  "[ঘ] সবার উপরে মানুষ সত্য, তাহার উপরে নাই"},
            {"[ক] সরুপথ",  "[খ] দীর্ঘ পথ",  "[গ] জমির সীমানা",  "[ঘ] দুর্গম পথ"},
            {"[ক] গীতাঞ্জলি",  "[খ] চর্যাপদ",  "[গ] অগ্নিবীণা",  "[ঘ] মহুয়ার পালা"},
            {"[ক] অবন ঠাকুর",  "[খ] জয়নুল আবেদিন",  "[গ] হরপ্রসাদ শাস্ত্রী",  "[ঘ] রবীন্দ্রনাথ ঠাকুর"},
            {"[ক] নেপাল",  "[খ] ইংল্যান্ড",  "[গ] ভুটান",  "[ঘ] শ্রীলঙ্কা"},
            {"[ক] একশত থেকে তিনশত শতকের মধ্যে",  "[খ] তিনশত থেকে পাঁচশত শতকের মধ্যে",  "[গ] পাঁচশত থেকে নয়শত শতকের মধ্যে",  "[ঘ] ছয়শত থেকে এগারোশ শতকের মধ্যে"},
            {"[ক] চর্যাপদে",  "[খ] গীতাঞ্জলিতে",  "[গ] অগ্নিবীণায়",  "[ঘ] মহুয়ার পালায়"},
            {"[ক] বাংলার নদ-নদীর ঐতিহ্য",  "[খ] বাঙালির ব্যবসায়-বাণিজ্যের ঐতিহ্য",  "[গ] বাংলার মাঝি-মাল্লার ইতিহাস",  "[ঘ] বিদেশিদের বাংলা আক্রমণের ইতিহাস"},
            {"[ক] মঙ্গল কাব্যে",  "[খ] চর্যাপদে",  "[গ] শ্রীকৃষ্ণকীর্তনে",  "[ঘ] মহুয়ার পালায়"},
            {"[ক] মহীপাল",  "[খ] দিব্য",  "[গ] তিতুমীর",  "[ঘ] হাজী শরিয়তউল্লাহ"}


    };

    public static String myCorrectAnswer[] = {

            "[গ] ১৯৩৫ সালে",
            "[ঘ] কুড়িগ্রাম",
            "[খ] সৈয়দ শামসুল হক",
            "[খ] ঢাকা কলেজিয়েট স্কুল",
            "[ঘ] সাংবাদিকতা",
            "[ক] পায়ের আওয়াজ পাওয়া যায়",
            "[খ] সীমান্তের সিংহাসন",
            "[ঘ] উপন্যাস",
            "[ক] বাংলাদেশে",
            "[ক] বাংলায়",
            "[গ] হাজার বছর",
            "[গ] চলার চিহ্ন ফেলে",
            "[ক] কোথা থেকে তুমি এলে?",
            "[ক] অক্ষর",
            "[গ] সওদাগরের",
            "[ক] কৈবর্তের",
            "[খ] পাল যুগের",
            "[ক] পাহাড়পুর",
            "[খ] সোনামসজিদ",
            "[গ] বারভূঁইয়াদের",
            "[ঘ] সবার উপরে মানুষ সত্য, তাহার উপরে নাই",
            "[গ] জমির সীমানা",
            "[খ] চর্যাপদ",
            "[গ] হরপ্রসাদ শাস্ত্রী",
            "[ক] নেপাল",
            "[ঘ] ছয়শত থেকে এগারোশ শতকের মধ্যে",
            "[ক] চর্যাপদে",
            "[খ] বাঙালির ব্যবসায়-বাণিজ্যের ঐতিহ্য",
            "[ক] মঙ্গল কাব্যে",
            "[খ] দিব্য"



    };













}
