package com.soft.mcqbanglabook;

public class BoiPora_QNA {

    public static String myQuestion[] ={
            "১. ‘বই পড়া’ প্রবন্ধ অনুসারে ডেমোক্রেসির উত্তরাধিকারী কারা?",
            "২. ‘জ্ঞানের সৃষ্টি মনসাপেক্ষ’। এখানে ‘মনসাপেক্ষ’ অর্থ কী?",
            "৩. প্রমথ চৌধুরীর মতে, দর্শনের চর্চা কোথায় করা যায়?",
            "৪. ‘বই পড়া’ প্রবন্ধে লেখক লাইব্রেরিকে হাসপাতালের ওপরে স্থান দিয়েছেন কেন?",
            "৫.‘বই পড়া’ রচনায় লেখক শিক্ষকদের কী হতে বলেছেন?",
            "৬. শিক্ষকের সার্থকতা কোথায়?",
            "৭. বিদ্যার সাধনায় গুরুকে ‘উত্তরসাধক’ বলা হয়েছে কেন?",
            "৮. শিষ্যকে বিদ্যার সাধনা কীভাবে করতে হয়?",
            "৯. ‘দেহের মৃত্যুর রেজিস্টারি রাখা হয়, আত্মার হয় না’—প্রমথ চৌধুরীর এ মন্তব্যে কী প্রকাশ পেয়েছে?",
            "১০. ‘শিক্ষার অপ্রয়োজনের দিকই শ্রেষ্ঠ দিক’ বলতে আসলে কোনটিকে বোঝানো হয়েছে?",


            "১১. আমাদের সবাইকে সাহিত্য চর্চা করতে হবে কেন?",
            "১২. প্রমথ চৌধুরীর মতে, অন্তর্নিহিত শক্তিকে জাগিয়ে দিতে পারে কে?",
            "১৩. কোন শক্তির বলে শিষ্য নিজের মন নিজে গড়ে তোলে?",
            "১৪. ‘আমরা যত বেশি লাইব্রেরি প্রতিষ্ঠা করব, দেশের তত বেশি উপকার হবে’—এ অংশটি কোন প্রবন্ধের?",
            "১৫. আমাদের স্কুল-কলেজে ছেলেরা বই পড়ে কীভাবে?",
            "১৬. প্রমথ চৌধুরীর মতে, আমাদের সমাজ কেমন?",
            "১৭. ‘পাস করা ও শিক্ষিত হওয়া এক বস্তু নয়’—এ মতবাদের বিরুদ্ধ মতবাদ কোনটি?",
            "১৮. স্কুল-কলেজের শিক্ষাকে ‘মারাত্মক’ বলা হয়েছে কেন?",
            "১৯. প্রমথ চৌধুরীর মতে ছেলেরা নোট মুখস্থ করে কেন?",
            "২০. জাতি হিসেবে আমরা ‘নির্জীব’ কেন?",


            "২১. মনের আক্ষেপ প্রকাশ করতে মাঝেমধ্যেই কী লাগাতে হয়?",
            "২২. প্রমথ চৌধুরী কাউকে শখ হিসেবে বই পড়ার পরামর্শ দেননি, কারণ—",
            "২৩. শিক্ষা কী দূর করবে বলে আমাদের বিশ্বাস?",
            "২৪. ‘যে জাতির জ্ঞানের ভান্ডার শূন্য, সে জাতির ধনের ভাঁড়েও ভবানী’—এ কথার অর্থ কী?",
            "২৫. লেখকের মতে, সাহিত্যচর্চা আসলে কী?",
            "২৬. কোনটির সঙ্গে সঙ্গে ফল পাওয়া যায় না?",
            "২৭. ‘সাহিত্যের নগদ বাজারদর নেই’—কারণ কী?",
            "২৮. ডেমোক্রেসি সাহিত্যের মর্মকথা বোঝে না কেন?",
            "২৯. ‘ব্যাধিই সংক্রামক, স্বাস্থ্য নয়।’ এখানে স্বাস্থ্য বলতে কী বোঝানো হয়েছে?",
            "৩০. সাহিত্যচর্চার সুফল সম্বন্ধে অনেকেই কী?"



    };


    public static String myChoices[][] = {

            {"ক. ইংরেজরা",  "খ. বাঙালিরা ",  "গ. ভারতীয়রা",  "ঘ. পাকিস্তানিরা"},
            {"ক. মনোবাঞ্ছিত",  "খ. মনোনিবিষ্ট ",  "গ. মননির্ভরশীল ",  "ঘ. মনোগ্রাহ্য"},
            {"ক. ঘরে",  "খ. জাদুঘরে ",  "গ. লাইব্রেরিতে",  "ঘ. গুহায়"},
            {"ক. মানসিক সুস্থতার জন্য",  "খ. শারীরিক সুস্থতার জন্য",  "গ. উচ্চশিক্ষা অর্জনের জন্য",  "ঘ. জ্ঞানে বড় হওয়ার জন্য"},
            {"ক. দাতা",  "খ. গ্রহীতা",  "গ. চালক ",  "ঘ. সহায়ক"},
            {"ক. আত্মনিবেদিত হয়ে শিক্ষাদানে",  "খ. শিক্ষা অর্জনে ছাত্রকে সক্ষম করায়",  "গ. শিক্ষার্থীকে জ্ঞানদান করায় ",  "ঘ. শিক্ষার্থীকে অধিক নম্বর অর্জনে সক্ষম করায়"},
            {"ক. শিষ্যকে বিদ্যা শেখান বলে ",  "খ. শিষ্যকে শিখতে উদ্বুদ্ধ করেন বলে",  "গ. শিষ্যকে মানুষ করে তোলেন বলে ",  "ঘ. শিষ্যকে পড়া মুখস্থের তাগিদ দেন বলে"},
            {"ক. নিজ চেষ্টায়",  "খ. বই পড়ে",  "গ. গুরুকে অনুসরণ করে ",  "ঘ. আত্মস্থ করে"},
            {"ক. জাতীয় দৃষ্টিভঙ্গির সংকীর্ণতা",  "খ. স্বাস্থ্যসেবার খণ্ডিত রূপ",  "গ. মানসিক স্বাস্থে্৵র প্রতি উদাসীনতা",  "ঘ. শিক্ষাপদ্ধতির সীমাবদ্ধতা"},
            {"ক. শিক্ষার্জনের মাধ্যমেই জীবসত্তাকে টিকিয়ে রাখা",  "খ. শিক্ষা লাভ করার মাধ্যমে মনুষ্যত্ব জাগ্রত করা",  "গ. শিক্ষালাভের মাধ্যমেই জীবনকে সাজানো",  "ঘ. শিক্ষার্জন মানেই বুদ্ধিমান মানুষ তৈরি হওয়া"},


            {"ক. শিক্ষালাভের জন্য ",  "খ. জ্ঞানলাভের জন্য",  "গ. প্রতিষ্ঠালাভের জন্য",  "ঘ. মানুষ হওয়ার জন্য"},
            {"ক. গুরু ",  "খ. শিষ্য",  "গ. সমাজ",  "ঘ. রাষ্ট্র"},
            {"ক. গুরুর",  "খ. আত্মার",  "গ. সাহিত্যের ",  "ঘ. ডেমোক্রেসির"},
            {"ক. বই পড়া ",  "খ. পল্লিসাহিত্য",  "গ. শিক্ষা ও মনুষ্যত্ব ",  "ঘ. সাহিত্যের রূপ ও রীতি"},
            {"ক. দায়ে পড়ে",  "খ. বাধ্য হয়ে",  "গ. স্বেচ্ছায়",  "ঘ. শিক্ষার জন্য"},
            {"ক. উচ্ছৃঙ্খল",  "খ. বিভ্রান্ত ",  "গ. নির্জীব",  "ঘ. নিরানন্দ"},
            {"ক. বিদ্যার সাধনা শিষ্যকে নিজে অর্জন করতে হয়",  "খ. সুশিক্ষিত লোক মাত্রই স্বশিক্ষিত",  "গ. শিক্ষা অর্জন ও গ্রহণের ব্যাপার",  "ঘ. জ্ঞানহীনে জ্ঞান দেন গুরু মহাশয়"},
            {"ক. অতিরিক্ত ব্যয়বহুল",  "খ. স্বশিক্ষিত হওয়ার শক্তি নষ্ট করে ",  "গ. পাঠ্য বিষয় জীবনবিমুখ ",  "ঘ. মুখস্থের ফলে জীবনী শক্তি ক্ষয় হয়"},
            {"ক. জ্ঞান অর্জন করতে",  "খ. শিক্ষিত হতে",  "গ. পেটের দায়ে",  "ঘ. বাহ্বা পেতে"},
            {"ক. সচ্ছলতার অভাবে",  "খ. আনন্দশূন্য বলে",  "গ. মনোবলের অভাবে ",  "ঘ. শৌখিনতা নেই বলে"},


            {" ক. কড়ি",  "খ. অর্থ ",  " গ. বই",  "ঘ. বুদ্ধি"},
            {" i. আমরা জাতি হিসেবে শৌখিন নই",  " ii. শখ হিসেবে বই পড়া সাহিত্যচর্চা নয় ",  "iii. ঠিক শখ",  "iv.সাহিত্যচর্চা নয় "},
            {"ক. ব্যথা ও বেদনা",  "খ. গায়ের জ্বালা ও চোখের জল",  " গ. বেকারত্ব ও দারিদ্র্য ",  " ঘ. অভাব ও দৈন্য"},
            {"ক. ধনার্জন জ্ঞানসাপেক্ষ ",  " খ. জ্ঞানার্জন ধনসাপেক্ষ",  " গ. বিষয় দুটো পরিপূরক ",  "ঘ. গরিবের ঘোড়া রোগ"},
            {" ক. মনের চিকিৎসা",  " খ. শিক্ষার সর্বপ্রধান অঙ্গ ",  "গ. শিক্ষার অন্যতম অঙ্গ ",  " ঘ. বিপ্লবী মানস অর্জন"},
            {"ক. কর্মের",  "খ. ধর্মের",  "গ. পরীক্ষার",  "ঘ. শিক্ষার"},
            {"ক. তৎক্ষণাৎ অর্থের উপার্জন হয় না",  "খ. মুহূর্তের মধ্যে মূল্যায়িত হয় না ",  "গ. নগদ মূল্য দিয়ে কিনতে চায় না ",  "ঘ. কেউ সাদরে গ্রহণ করে না"},
            {" ক. বাজার মূল্য নেই বলে",  " খ. মানবিক মূল্যহীন বলে",  "গ. সামাজিক মূল্যের অভাব বলে ",  " ঘ. জৈবিক মূল্য নগণ্য বলে"},
            {" ক. যা আপনা–আপনি আসে",  "খ. ছোঁয়াচে রোগের মতো",  "গ. যা অর্জন করতে হয় ",  "ঘ. অনায়াস পাওয়া যায়"},
            {"ক. ভাগ্যবান ",  "খ. নিশ্চিত",  "গ. সন্দিহান",  "ঘ. আগ্রহী"}






    };


    public static String myCorrectAnswer[] = {


            "ক. ইংরেজরা",
            "গ. মননির্ভরশীল ",
            "ঘ. গুহায়",
            "ক. মানসিক সুস্থতার জন্য",
            "ঘ. সহায়ক",
            "খ. শিক্ষা অর্জনে ছাত্রকে সক্ষম করায়",
            "খ. শিষ্যকে শিখতে উদ্বুদ্ধ করেন বলে",
            "ক. নিজ চেষ্টায়",
            "ক. জাতীয় দৃষ্টিভঙ্গির সংকীর্ণতা",
            "খ. শিক্ষা লাভ করার মাধ্যমে মনুষ্যত্ব জাগ্রত করা",

            "ঘ. মানুষ হওয়ার জন্য",
            "ক. গুরু ",
            "খ. আত্মার",
            "ক. বই পড়া ",
            "খ. বাধ্য হয়ে",
            "গ. নির্জীব",
            "ঘ. জ্ঞানহীনে জ্ঞান দেন গুরু মহাশয়",
            "খ. স্বশিক্ষিত হওয়ার শক্তি নষ্ট করে ",
            "গ. পেটের দায়ে",
            "খ. আনন্দশূন্য বলে",


            " ক. কড়ি",
            " i. আমরা জাতি হিসেবে শৌখিন নই",
            " গ. বেকারত্ব ও দারিদ্র্য ",
            "ক. ধনার্জন জ্ঞানসাপেক্ষ ",
            " খ. শিক্ষার সর্বপ্রধান অঙ্গ ",
            "ঘ. শিক্ষার",
            "ক. তৎক্ষণাৎ অর্থের উপার্জন হয় না",
            " ক. বাজার মূল্য নেই বলে",
            "গ. যা অর্জন করতে হয় ",
            "গ. সন্দিহান",


    };


}
