package com.soft.mcqbanglabook;

public class DenapawnaQNA {



    public static String myQuestion[] ={
            "১. রবীন্দ্রনাথ ঠাকুরের জন্ম তারিখ কোনটি?",
            "২. রবীন্দ্রনাথ ঠাকুর কত খ্রিষ্টাব্দে জন্মগ্রহণ করেন?",
            "৩. রবীন্দ্রনাথের জন্মস্থান কোনটি?",
            "৪. রবীন্দ্রনাথ ঠাকুরের পিতার নাম কী?",
            "৫. কখন রবীন্দ্রনাথের কাব্যপ্রতিভার উন্মেষ ঘটে?",
            "৬. প্রিন্স দ্বারকানাথ ঠাকুর সম্পর্কে রবীন্দ্রনাথ ঠাকুরের কী ছিলেন?",
            "৭. রবীন্দ্রনাথ ঠাকুরের প্রথম প্রকাশিত কাব্যের নাম কী?",
            "৮. ‘বনফুল’ কাব্য প্রকাশের সময় রবীন্দ্রনাথের বয়স কত ছিল?",
            "৯. রবীন্দ্রনাথ ঠাকুর কত সালে নোবেল পুরস্কার লাভ করেন?",
            "১০. কোন রচনার জন্য রবীন্দ্রনাথ নোবেল পুরস্কার পান?",
            "১১. রবীন্দ্রনাথ ঠাকুর বঙ্গাব্দের কোন তারিখে মৃত্যুবরণ করেন?",
            "১২. রবীন্দ্রনাথ ঠাকুরের মৃত্যু হয় কত সালে?",
            "১৩. রবীন্দ্রনাথ ঠাকুর কোথায় শেষনিশ্বাস ত্যাগ করেন?",
            "১৪. ‘দেনাপাওনা’ গল্পে বর্ণিত নিরুপমার ভাই কয়টি?",
            "১৫. নিরুপমার পারিবারিক আবহ অনুযায়ী তার নামটিকে কী বলা হয়েছে?",
            "১৬. নিরুপমার পারিবারিক আবহ অনুয়ায়ী কোন নামটি তার জন্য মানানসই হতো?",
            "১৭. নিরুপমার বাবার নাম কী?",
            "১৮. ‘দেনাপাওনা’ গল্পে কোন জিনিসটি কিছুতেই রামসুন্দরের মনের মতো হয় না?",
            "১৯. রামসুন্দর কেমন ঘরের ছেলের সাথে তাঁর কন্যার বিয়ে ঠিক করলেন?",
            "২০. নিরুপমার বিয়ের সময় বরপক্ষ কত টাকা পণ দাবি করল?",
            "২১. বরপক্ষ বিপুল অঙ্কের পণ দাবি করলেও নিরুপমার বাবা কোনোরূপ বিবেচনা ছাড়াই রাজি হয়ে গেলেন কেন?",
            "২২. ‘বিবাহসভায় তুমুল গোলযোগ বাধিয়া গেল।’-কেন?",
            "২৩. ‘বর সভাস্থ করা যাইবে না।’-কেন?",
            "২৪. নিরুপমার শ্বশুরবাড়ির লোকদের কাছে কোনটি সবচেয়ে গুরুত্বপূর্ণ ছিল?",
            "২৫. ‘অন্তঃপুরে একটা কান্না পড়িয়া গেল।’-কেন?",
            "২৬. নিরুপমার বরের অবাধ্যতার কারণ হিসেবে দু-একজন প্রবীণ ব্যক্তি কোনটিকে চিহ্নিত করলেন?",
            "২৭. বেহাইবাড়িতে রামসুন্দরের প্রতিপত্তি ছিল না কেন?",
            "২৮. রামসুন্দরকে নানারূপ হীন কৌশল অবলম্বন করতে হতো কেন?",
            "২৯. নিরুপমা শ্বশুরবাড়িতে ঠিকমতো যত্ন পায় না কেন?",
            "৩০. পণের বাকি টাকা জোগাড় করতে রামসুন্দর কী স্থির করলেন?"



    };

    public static String myChoices[][] = {

            {"ক. ২২শে বৈশাখ ১২৬৮",  "খ. ২৫শে বৈশাখ ১২৬৮",  "গ. ২২শে শ্রাবণ",  "ঘ. ২৫শে শ্রাবণ ১২৬৮"},
            {"ক. ১৮৬১",  "খ. ১৮৬২",  "গ. ১৮৬৪",  "ঘ. ১৮৬৮"},
            {"ক. বীরভূম",  "খ. কলকাতা",  "গ. মালদহ",  "ঘ. ত্রিপুরা"},
            {"ক. দেবেন্দ্রনাথ ঠাকুর",  "খ. দ্বারকানাথ ঠাকুর",  "গ. অবনীন্দ্রনাথ ঠাকুর",  "ঘ. রথীন্দ্রনাথ ঠাকুর"},
            {"ক. বাল্যকালে",  "খ. কৈশোরে",  "গ. যৌবনে",  "ঘ. বৃদ্ধ বয়সে"},
            {"ক. পিতা",  "খ. ভ্রাতা",  "গ. পিতামহ",  "ঘ. প্র-পিতামহ"},
            {"ক. সোনার তরী",  "খ. ক্ষণিকা",  "গ. গীতাঞ্জলি",  " ঘ. বনফুল"},
            {"ক. ১০",  "খ. ১২",  "গ. ১৫",  "ঘ. ১৮"},
            {"ক. ১৯১১",  "খ. ১৯১২",  "গ. ১৯১৩",  "ঘ. ১৯১৪"},
            {"ক. বনফুল",  "খ. গীতাঞ্জলি",  "গ. রক্তকরবী",  "ঘ. বলাকা"},
            {"ক. ২৫শে বৈশাখ ১২৪৮",  "খ. ২২শে শ্রাবণ ১২৪৮",  "গ. ২৫শে বৈশাখ ১৩৪৮",  " ঘ. ২২শে শ্রাবণ ১৩৪৮"},
            {"ক. ১৯৪১",  "খ. ১৯৪৪",  "গ. ১৯৪৭",  "ঘ. ১৯৪৮"},
            {" ক. প্যারিসে",  "খ. কলকাতায়",  "গ. ঢাকায়",  "ঘ. লন্ডনে"},
            {" ক. দুইটি",  "খ. তিনটি",  "গ. চারটি",  "ঘ. পাঁচটি"},
            {"ক. হাস্যকর",  "খ. শৌখিন",  "গ. অদ্ভুত",  "ঘ. অপ্রয়োজনীয়"},
            {"ক. দুর্গা",  "খ. জেনিফার",  " গ. শিশির",  "ঘ. সুইটি"},
            {"ক. হরমোহন",  "খ. ফণীভূষণ",  "গ. রামসুন্দর",  "ঘ. ঠাকুরদাস"},
            {" ক. পণের অঙ্ক",  "খ. পাত্র",  "গ. কন্যার নাম",  "ঘ. বিয়ের আয়োজন"},
            {"ক. দরিদ্র",  "খ. সম্ভ্রান্ত",  "গ. সাধারণ",  "ঘ. অত্যন্ত ধনী"},
            {" ক. পাঁচ হাজার",  "খ. দশ হাজার",  "গ. পনেরো হাজার",  "ঘ. বিশ হাজার"},
            {"ক. মেয়ের সুখের কথা ভেবে",  "খ. নিজের সুনামের কথা ভেবে",  "গ. কন্যার দায়ভার থেকে মুক্তি পেতে",  "ঘ. অর্থের অভাব ছিল না বলে"},
            {"ক. কনে বিয়েতে অস্বীকৃতি জানানোয়",  " খ. বর বিয়েতে অস্বীকৃতি জানানোয়",  "গ. বরের পিতা বিয়েতে অস্বীকৃতি জানানোয়",  "ঘ. কনের বাবা বিয়েতে অস্বীকৃতি জানানোয়"},
            {"ক. পণের সম্পূর্ণ টাকা না পাওয়ায়",  "খ. কনে প্রতিবন্ধী প্রমাণিত হওয়ায়",  "গ. লগ্ন পার হয়ে যাওয়ায়",  "ঘ. বর অসুস্থ হয়ে পড়ায়"},
            {"ক. ছেলের সুখ",  " খ. অপরের কল্যাণ",  "গ. নিজের স্বার্থসিদ্ধি",  "ঘ. সংসারের শান্তি"},
            {"ক. নিরুপমার বিদায়লগ্ন উপস্থিত হওয়ায়",  "খ. নিরুপমার অমঙ্গল আশঙ্কায়",  "গ. নিরুপমা বিয়েতে অস্বীকৃতি জানানোয়",  "ঘ. নিরুপমা পালিয়ে যাওয়ায়"},
            {"ক. শাস্ত্র ও নীতি শিক্ষার অভাব",  "খ. আধুনিক শিক্ষার কুফল",  "গ. পারিবারিক শিক্ষার অভাব",  "ঘ. অশিক্ষার কুফল"},
            {"ক. পণের টাকা শোধ না হওয়ায়",  "খ. সাধারণ বংশের লোক হওয়ায়",  "গ. ঘন ঘন যাওয়ায়",  "ঘ. উপহার নিতে না পারায়"},
            {"ক. মেয়েকে একনজর দেখার জন্য",  "খ. পাওনাদারদের কাছ থেকে পালানোর জন্য",  "গ. বেহাইয়ের দৃষ্টিপথ এড়ানোর জন্য",  "ঘ. নাতি-নাতনির আবদার পূরণ করতে"},
            {"ক. নিজের স্বভাবের কারণে",  "খ. শ্বশুরের দারিদ্র্যের কারণে",  "গ. বাবার দীনতার কারণে",  " ঘ. স্বামীর অবহেলার কারণে"},
            {"ক. বসতভিটা বিক্রি করবেন",  "খ. জমি-জমা বিক্রি করবেন",  "গ. হীন কৌশল অবলম্বন করবেন",  "ঘ. সমস্ত সম্পত্তি বন্ধক রাখবেন"}


    };





    public static String myCorrectAnswer[] = {

            "খ. ২৫শে বৈশাখ ১২৬৮",
            "ক. ১৮৬১",
            "খ. কলকাতা",
            "ক. দেবেন্দ্রনাথ ঠাকুর",
            "ক. বাল্যকালে",
            "গ. পিতামহ",
            " ঘ. বনফুল",
            "গ. ১৫",
            "গ. ১৯১৩",
            "খ. গীতাঞ্জলি",
            " ঘ. ২২শে শ্রাবণ ১৩৪৮",
            "ক. ১৯৪১",
            "খ. কলকাতায়",
            "ঘ. পাঁচটি",
            "খ. শৌখিন",
            "ক. দুর্গা",
            "গ. রামসুন্দর",
            "খ. পাত্র",
            "খ. সম্ভ্রান্ত",
            "খ. দশ হাজার",
            "ক. মেয়ের সুখের কথা ভেবে",
            "গ. বরের পিতা বিয়েতে অস্বীকৃতি জানানোয়",
            "ক. পণের সম্পূর্ণ টাকা না পাওয়ায়",
            "গ. নিজের স্বার্থসিদ্ধি",
            "খ. নিরুপমার অমঙ্গল আশঙ্কায়",
            "ক. শাস্ত্র ও নীতি শিক্ষার অভাব",
            "ক. পণের টাকা শোধ না হওয়ায়",
            "খ. পাওনাদারদের কাছ থেকে পালানোর জন্য",
            "গ. বাবার দীনতার কারণে",
            "ক. বসতভিটা বিক্রি করবেন"


    };



}
