package com.soft.mcqbanglabook;

public class EkattorER_DinguliQNA {





    public static String myQuestion[] ={
            "১. ‘একাত্তরের দিনগুলি’ স্মৃতিচারণমূলক রচনাটি কে লিখেছেন?",
            "২. জাহানারা ইমাম কত সালে জন্মগ্রহণ করেন?",
            "৩. জাহানারা ইমাম কত তারিখে জন্মগ্রহণ করেন?",
            "৪. জাহানারা ইমামের জন্ম কোথায়?",
            "৫. জাহানারা ইমামের পিতার নাম কী?",
            "৬. জাহানারা ইমামের পিতা পেশায় কী ছিলেন?",
            "৭. জাহানারা ইমাম কত সালে বি.এ পাস করেন?",
            "৮. কোন কলেজ থেকে জাহানারা ইমাম বিএ পাস করেন?",
            "৯. ঢাকায় কোন স্কুলে জাহনারা ইমাম প্রধান শিক্ষকের দায়িত্ব পালন করেন?",
            "১০. জাহানারা ইমাম কোন বিশ্ববিদ্যালয় থেকে বিএড ও এমএ ডিগ্রি লাভ করেন?",
            "১১. জাহানারা ইমাম কোন বিষয়ে এমএ ডিগ্রি লাভ করেন?",
            "১২. জাহানারা ইমাম কোন কলেজে অধ্যাপনা করেন?",
            "১৩. জাহানারা ইমামের প্রথম সন্তানের নাম কী?",
            "১৪. রুমী কখন শহিদ হন?",
            "১৫. জাহানারা ইমাম কী হিসেবে পরিচিত?",
            "১৬. জাহানারা ইমামের কোন গ্রন্থটি সর্বত্র সমাদৃত?",
            "১৭. সাহিত্যকর্মে অবদানের জন্য জাহানারা ইমাম কোন পুরস্কার পান?",
            "১৮. জাহানারা ইমাম কাদের বিরুদ্ধে আমৃত্যু সংগ্রাম করেছেন?",
            "১৯. জাহানারা ইমাম কত সালে মৃত্যুবরণ করেন?",
            "২০. ৭১ সালের ১৩ই এপ্রিল কী বার ছিল?",
            "২১. ‘একাত্তরের দিনগুলি’ রচনায় কদিন ধরে বৃষ্টি হওয়ার কথা বলা আছে?",
            "২২. জাহানারা ইমামের শ্বশুর কী ছিলেন?",
            "২৩. ‘নদীতে নাকি প্রচুর লাশ ভেসে যাচ্ছে’- ‘একাত্তরের দিনগুলি’ রচনায় উক্তিটি কার? ",
            "২৪. ‘একাত্তরের দিনগুলি’ রচনায় কোন গাছের উল্লেখ আছে?",
            "২৫. মুক্তিযুদ্ধের সময় সারা দেশে কাদের অত্যাচার চলছিল?",
            "২৬. ‘একাত্তরের দিনগুলি’ রচনায় বর্ণিত জামী কোন শ্রেণির ছাত্র ছিল?",
            "২৭. ‘একাত্তরের দিনগুলি’ রচনায় ‘কর্তাদের’ বলতে কাদের বোঝানো হয়েছে?",
            "২৮. ১৯৭১ সালের ১৭ই মে পত্রিকায় কতজন বুদ্ধিজীবী ও শিল্পীর বিবৃতি বেরিয়েছিল?",
            "২৯. ‘একাত্তরের দিনগুলি’ রচনায় বুদ্ধিজীবীদের বিবৃতি কিসে ভরা ছিল?",
            "৩০. ২৫শে মে কার জন্মজয়ন্তী?"



    };



    public static String myChoices[][] = {

            {"ক. সুফিয়া কামাল",  "খ. জাহানারা ইমাম",  "গ. শহীদুল্লা কায়সার",  "ঘ. শাহরিয়ার কবির"},
            {"ক. ১৯২৩",  "খ. ১৯২৫",  "গ. ১৯৩০",  " ঘ. ১৯২০"},
            {"ক. ৫ই জুলাই",  "খ. ১৫ই জুলাই",  "গ. ৩ই মে",  "ঘ. ৮ই মে"},
            {"ক. বরিশাল",  "খ. কুমিল্লা",  "গ. মুর্শিদাবাদ",  "ঘ. কলকাতা"},
            {"ক. সৈয়দ আব্দুল আলী",  "খ. সৈয়দ জামালুদ্দীন",  "গ. সৈয়দ মাজহার আলী",  " ঘ. সৈয়দ নজরুল ইসলাম"},
            {"ক. আইনজীবী",  "খ. ডাক্তার",  "গ. অধ্যাপক",  "ঘ. ডেপুটি ম্যাজিস্ট্রেট"},
            {"ক. ১৯৪৫",  "খ. ১৯৪৭",  "গ. ১৯৫০",  "ঘ. ১৯৫৫"},
            {"ক. বরিশালের বিএম কলেজ",  "খ. মানিকগঞ্জের দেবেন্দ্র কলেজ",  "গ. ফরিদপুরের রাজেন্দ্র কলেজ",  "ঘ. কলকাতার ব্রেবোর্ন কলেজ"},
            {"ক. ভিকারুননিসা নূন স্কুল",  "খ. সিদ্ধেশ্বরী গার্লস স্কুল",  "গ. আজিমপুর গভ. গার্লস স্কুল",  "ঘ. খিলগাঁও গার্লস স্কুল"},
            {"ক. ঢাকা বিশ্ববিদ্যালয়",  "খ. রাজশাহী বিশ্ববিদ্যালয়",  "গ. জাহাঙ্গীরনগর বিশ্ববিদ্যালয়",  "ঘ. চট্টগ্রাম বিশ্ববিদ্যালয়"},
            {"ক. ইতিহাস",  "খ. সমাজবিজ্ঞান",  "গ. বাংলা",  "ঘ. জনপ্রশাসন"},
            {"ক. নটরডেম কলেজ",  "খ. ঢাকা কলেজ",  "গ. ঢাকা টিচার্স ট্রেনিং কলেজ",  "ঘ. সরকারি বদরুন্নেসা মহিলা কলেজ"},
            {" ক. রুমী",  "খ. সজল",  "গ. সাদিক",  "ঘ. জামী"},
            {"ক. মুক্তিযুদ্ধের প্রথম দিকে",  " খ. মুক্তিযুদ্ধের মধ্যভাগে",  "গ. মুক্তিযুদ্ধের শেষদিকে",  "ঘ. মুক্তিযুদ্ধের পরপর"},
            {" ক. লৌহমানবী",  "খ. শহিদ জননী",  "গ. জাতীয় শিক্ষক",  "ঘ. প্রধান কবি"},
            {"ক. ক্যান্সারের সঙ্গে আবাস",  "খ. একাত্তরের দিনগুলি",  "গ. প্রবাসের দিনগুলি",  "ঘ. গজকচ্ছপ"},
            {"ক. নোবেল পুরস্কার",  "খ. বাংলা একাডেমি পুরস্কার",  "গ. স্বাধীনতা দিবস পুরস্কার",  " ঘ. আলাওল সাহিত্য পুরস্কার"},
            {"ক. একাত্তরের ঘাতকদের",  "খ. পাকিস্তানিদের",  "গ. কুসংস্কারাচ্ছন্নদের",  "ঘ. ধর্মান্ধদের"},
            {"ক. ১৯৯৮",  "খ. ১৯৯৪",  "গ. ১৯৯০",  "ঘ. ১৯৯২"},
            {"ক. শনিবার",  "খ. সোমবার",  "গ. মঙ্গলবার",  "ঘ. বৃহস্পতিবার"},
            {" ক. ৭ দিন",  "খ. ১০ দিন",  " গ. ৪ দিন",  "ঘ. ৩ দিন"},
            {"ক. অন্ধ",  "খ. বোবা",  "গ. পঙ্গু",  "ঘ. অসুস্থ"},
            {"ক. লেখিকার",  "খ. করিমের",  " গ. মাঝির",  "ঘ. দোকানির"},
            {"ক. শিউলি",  "খ. বকুল",  "গ. গোলাপ",  "ঘ. গন্ধরাজ"},
            {"ক. পাকিস্তানি হানাদারদের",  "খ. রাজাকারদের",  "গ. রক্ষীবাহিনীর",  "ঘ. সর্বহারাদের"},
            {"ক. ৮ম",  "খ. ৯ম",  "গ. ১০ম",  "ঘ. ৫ম"},
            {"ক. মুক্তিযোদ্ধাদের",  "খ. পাকিস্তানি শাসকদের",  " গ. রাজাকারদের",  "ঘ. ভারতীয়দের"},
            {"ক. ৭০ জন",  " খ. ৫৫ জন",  " গ. ৪০ জন",  "ঘ. ৩০ জন"},
            {"ক. মিথ্যা ভাষণে",  "খ. ভুল-ভ্রান্তিতে",  "গ. গুরুচণ্ডালী দোষে",  "ঘ. কটূক্তিতে"},
            {"ক. রবীন্দ্রনাথ ঠাকুরের",  "খ. কাজী নজরুলের",  "গ. ফররুক আহমদের",  "ঘ. আহসান হাবীবের"}


    };





    public static String myCorrectAnswer[] = {

            "খ. জাহানারা ইমাম",
            "ক. ১৯২৩",
            "গ. ৩ই মে",
            "গ. মুর্শিদাবাদ",
            "ক. সৈয়দ আব্দুল আলী",
            "ঘ. ডেপুটি ম্যাজিস্ট্রেট",
            "খ. ১৯৪৭",
            "ঘ. কলকাতার ব্রেবোর্ন কলেজ",
            "খ. সিদ্ধেশ্বরী গার্লস স্কুল",
            "ক. ঢাকা বিশ্ববিদ্যালয়",
            "গ. বাংলা",
            "গ. ঢাকা টিচার্স ট্রেনিং কলেজ",
            " ক. রুমী",
            "গ. মুক্তিযুদ্ধের শেষদিকে",
            "খ. শহিদ জননী",
            "খ. একাত্তরের দিনগুলি",
            "খ. বাংলা একাডেমি পুরস্কার",
            "ক. একাত্তরের ঘাতকদের",
            "খ. ১৯৯৪",
            "গ. মঙ্গলবার",
            " গ. ৪ দিন",
            "ক. অন্ধ",
            "খ. করিমের",
            "গ. গোলাপ",
            "ক. পাকিস্তানি হানাদারদের",
            "গ. ১০ম",
            "খ. পাকিস্তানি শাসকদের",
            " খ. ৫৫ জন",
            "ক. মিথ্যা ভাষণে",
            "খ. কাজী নজরুলের"


    };








}
