package com.soft.mcqbanglabook;

public class JibonSongitQNA {


    public static String myQuestion[] ={
            "১. ‘জীবন-সঙ্গীত’ কবিতাটির রচয়িতা কে?",
            "২. হেমচন্দ্র বন্দ্যোপাধ্যায় কত সালে জন্মগ্রহণ করেন?",
            "৩. হেমচন্দ্র বন্দ্যোপাধ্যায় কোথায় জন্মগ্রহণ করেন?",
            "৪. হেমচন্দ্র বন্দ্যোপাধ্যায়ের পিতার নাম কী?",
            "৫. হেমচন্দ্র বন্দ্যোপাধ্যায়ের পড়ালেখা বন্ধ হয়ে যায় কেন?",
            "৬. হেমচন্দ্র বন্দ্যোপাধ্যায় আর্থিক সংকটে পড়েন কোথায় পড়াশোনার সময়?",
            "৭. হেমচন্দ্র বন্দ্যোপাধ্যায় কার আশ্রয়ে ইংরেজি শেখেন?",
            "৮. হেমচন্দ্র বন্দ্যোপাধ্যায় কোন প্রতিষ্ঠান থেকে সিনিয়র স্কুল পরীক্ষায় উত্তীর্ণ হন?",
            "৯. হেমচন্দ্র বন্দ্যোপাধ্যায় কত সালে স্নাতক ডিগ্রি লাভ করেন?",
            "১০. হেমচন্দ্র বন্দ্যোপাধ্যায় কোন প্রতিষ্ঠান থেকে স্নাতক ডিগ্রি লাভ করেন?",
            "১১. মাইকেল মধুসূদন দত্তের পরে কাব্য রচনায় সবচেয়ে খ্যাতিমান কে ছিলেন?",
            "১২. হেমচন্দ্র বন্দ্যোপাধ্যায় রচিত মহাকাব্যের নাম কী?",
            "১৩. হেমচন্দ্র বন্দ্যোপাধ্যায়ের কোন রচনাটি স্বদেশপ্রেমের অনুপ্রেরণায় রচিত?",
            "১৪. হেমচন্দ্র বন্দ্যোপাধ্যায় কত সালে মৃত্যুবরণ করেন?",
            "১৫. ‘জীবন-সঙ্গীত’ কবিতায় কবি কাতর স্বরে কী বলতে নিষেধ করেছেন?",
            "১৬. ‘জীবন-সঙ্গীত’ কবিতায় কবি কী বলে ক্রন্দন করতে নিষেধ করেছেন?",
            "১৭. ‘জীব করো না ক্রন্দন’ এখানে ‘জীব’ বলতে কবি কী বুঝিয়েছেন?",
            "১৮. কবি কিসে ভুলতে নিষেধ করেছেন? ",
            "১৯. কবি কোনটিকে অনিত্য নয় বলেছেন?",
            "২০. “ওহে জীব কর আকিঞ্চন” এখানে ‘আকিঞ্চন’ কী অর্থে ব্যবহৃত হয়েছে?",
            "২১. কবি সংসারে কী করেতে বলেছেন?",
            "২২. কী করলে ভবের উন্নতি হয়? ",
            "২৩. “বেগে ধায় নাহি রহে স্থির”- কী?",
            "২৪. ‘জীবন-সঙ্গীত’ কবিতায় কবি শৈবালের নীরের সাথে তুলনা করেছেন কোনটিকে?",
            "২৫. ‘জীবন-সঙ্গীত’ কবিতায় কবি কোথায় ভয়ে ভীত হতে নিষেধ করেছেন?",
            "২৬. ‘জীবন-সঙ্গীত’ কবিতা অনুসারে কী করলে জয় হবে?",
            "২৭. ‘জীবন-সঙ্গীত’ কবিতায় কবির মতে জগতে কোনটি দুর্লভ?",
            "২৮. কবি কিসে নির্ভর করতে নিষেধ করেছেন?",
            "২৯. কবি কোনটি চিন্তা করে কাতর হতে নিষেধ করেছেন?",
            "৩০. কারা প্রাতঃস্মরণীয়?"



    };

    public static String myChoices[][] = {

            {"ক. কাজী নজরুল ইসলাম",  "খ. রবীন্দ্রনাথ ঠাকুর",  "গ. হেমচন্দ্র বন্দ্যোপাধ্যায়",  "ঘ. মাইকেল মধুসূদন দত্ত"},
            {"ক. ১৮৩৬ সালে",  " খ. ১৮৩৭ সালে",  " গ. ১৮৩৮ সালে",  "ঘ. ১৮৩৯ সালে"},
            {"ক. মেদিনীপুর",  " খ. হুগলি",  "গ. পশ্চিমবঙ্গ",  "ঘ. বর্ধমান"},
            {"ক. হরিহর বন্দ্যোপাধ্যায়",  "খ. কৈলাশচন্দ্র বন্দ্যোপাধ্যায়",  " গ. রঙ্গলাল বন্দ্যোপাধ্যায়",  "ঘ. মহানন্দা বন্দ্যোপাধ্যায়"},
            {"ক. এলাকা ছেড়ে চলে যাওয়ায়",  "খ. স্কুল থেকে বিতাড়িত হওয়ায়",  "গ. আর্থিক সংকটের কারণে",  "ঘ. পরিবারের অনীহায়"},
            {"ক. হিন্দু কলেজে",  "খ. কলকাতা বিশ্ববিদ্যালয়ে",  "গ. কলকাতা খিদিরপুর বাংলা স্কুলে",  " ঘ. কলকাতা সংস্কৃত কলেজে"},
            {"ক. ঈশ্বরচন্দ্র বিদ্যাসাগরের",  "খ. অধ্যক্ষ প্রসন্নকুমার সর্বাধিকারীর",  "গ. কৈলাশচন্দ্র বন্দ্যোপাধ্যায়ের",  "ঘ. রাজা রামমোহন রায়ের"},
            {"ক. খিদিরপুর বাংলা স্কুল",  "খ. সংস্কৃত কলেজ",  "গ. হিন্দু কলেজ",  "ঘ. কলকাতা বিশ্ববিদ্যালয়"},
            {"ক. ১৮৫৫ সালে",  "খ. ১৮৫৭ সালে",  "গ. ১৮৫৯ সালে",  "ঘ. ১৮৬১ সালে"},
            {"ক. সংস্কৃত কলেজ",  "খ. হিন্দু কলেজ",  "গ. আলীগড় বিশ্ববিদ্যালয়",  "ঘ. কলকাতা বিশ্ববিদ্যালয়"},
            {"ক. বঙ্গলাল বন্দ্যোপাধ্যায়",  "খ. রবীন্দ্রনাথ ঠাকুর",  " গ. কাজী নজরুল ইসলাম",  "ঘ. হেমচন্দ্র বন্দ্যোপাধ্যায়"},
            {"ক. মেঘনাদবধ",  "খ. মহাশ্মশান",  "গ. বৃত্রসংহার",  "ঘ. আশাকানন"},
            {"ক. বৃত্রসংহার",  "খ. ছায়াময়ী",  " গ. চিন্তাতরঙ্গিনী",  "ঘ. আশাকানন"},
            {"ক. ১৯০১ সালে",  " খ. ১৯০২ সালে",  "গ. ১৯০৩ সালে",  " ঘ. ১৯০৪ সালে"},
            {"ক. বৃথা জন্ম এ সংসারে",  "খ. সময় কাহারো নয়",  "গ. সংসারে সংসারী সাজ",  "ঘ. জীবাত্মা অনিত্য নয়"},
            {"ক. সকলি ঘুচায় কাল",  "খ. জীবাত্মা অনিত্য নয়",  "গ. তুমি কার কে তোমার",  "ঘ. মানব-জনম সার"},
            {"ক. প্রাণী",  " খ. মানুষ",  "গ. পশুপাখি",  "ঘ. জীবন"},
            {"ক. সংসারে",  "খ. পরিবারে",  "গ. সুখে",  "ঘ. বাহ্যদৃশ্যে"},
            {"ক. জীবাত্মাকে",  "খ. পরিবারকে",  " গ. সংসারকে",  "ঘ. মহিমাকে"},
            {"ক. অর্জন অর্থে",  "খ. মহিমা অর্থে",  " গ. উদ্দেশ্য অর্থে",  "ঘ. চেষ্টা অর্থে"},
            {"ক. সংসারী সাজতে",  "খ. বৈরাগী হতে",  "গ. বিরক্ত হতে",  "ঘ. অলস হতে"},
            {"ক. ভবিষ্যতে নির্ভর করেলে",  "খ. অতীত চিন্তা করেলে",  "গ. নিত্য নিজ কাজ করেলে",  "ঘ. চিন্তা করে কাতর হলে"},
            {"ক. সময়",  "খ. সুখের দিন",  "গ. মহিমা",  "ঘ. নিশার স্বপন"},
            {"ক. সময়কে",  "খ. আয়ুকে",  "গ. সংসারকে",  "ঘ. বাহ্যদৃশ্যকে"},
            {"ক. ঘরের বাইরে",  "খ. পরিবারে",  "গ. সংসার সমরাঙ্গনে",  "ঘ. ভবিষ্যৎ চিন্তায়"},
            {"ক. ভয় পেলে",  "খ. সুখের আশা করলে",  "গ. যত্ন করলে",  "ঘ. বাহ্যদৃশ্য ভুললে"},
            {"ক. মহাজ্ঞানী",  "খ. সময়",  "গ. জীবাত্মা",  "ঘ. মহিমা"},
            {"ক. সময়ে",  "খ. ভবিষ্যতে",  "গ. পরিবারে",  "ঘ. বাহ্যদৃশ্যে ভুললে"},
            {"ক. সংসারের উন্নতি",  "খ. অতীত সুখের দিন",  "গ. ভবের উন্নতি",  "ঘ. মহাজ্ঞানীদের পথ"},
            {"ক. মহাজ্ঞানীরা",  "খ. সংসারীরা",  "গ. বৈরাগীরা",  " ঘ. ভবিষ্যতে নির্ভরকারীরা"}


    };

    public static String myCorrectAnswer[] = {

            "গ. হেমচন্দ্র বন্দ্যোপাধ্যায়",
            " গ. ১৮৩৮ সালে",
            " খ. হুগলি",
            "খ. কৈলাশচন্দ্র বন্দ্যোপাধ্যায়",
            "গ. আর্থিক সংকটের কারণে",
            "গ. কলকাতা খিদিরপুর বাংলা স্কুলে",
            "খ. অধ্যক্ষ প্রসন্নকুমার সর্বাধিকারীর",
            "গ. হিন্দু কলেজ",
            "গ. ১৮৫৯ সালে",
            "ঘ. কলকাতা বিশ্ববিদ্যালয়",
            "ঘ. হেমচন্দ্র বন্দ্যোপাধ্যায়",
            "গ. বৃত্রসংহার",
            "ক. বৃত্রসংহার",
            "গ. ১৯০৩ সালে",
            "ক. বৃথা জন্ম এ সংসারে",
            "গ. তুমি কার কে তোমার",
            " খ. মানুষ",
            "ঘ. বাহ্যদৃশ্যে",
            "ক. জীবাত্মাকে",
            "ঘ. চেষ্টা অর্থে",
            "ক. সংসারী সাজতে",
            "গ. নিত্য নিজ কাজ করেলে",
            "ক. সময়",
            "খ. আয়ুকে",
            "গ. সংসার সমরাঙ্গনে",
            "গ. যত্ন করলে",
            "ঘ. মহিমা",
            "খ. ভবিষ্যতে",
            "খ. অতীত সুখের দিন",
            "ক. মহাজ্ঞানীরা"


    };





}
