package com.soft.mcqbanglabook;

public class KopotakkhoNodQNA {



    public static String myQuestion[] ={
            "১. ‘কপোতাক্ষ নদ’ কবিতাটির রচয়িতা কে?",
            "২. মাইকেল মধুসূদন দত্তের জন্মতারিখ কোনটি?",
            "৩. মাইকেল মধুসূদন দত্ত কোন জেলায় জন্মগ্রহণ করেন? ",
            "৪. মাইকেল মধুসূদন দত্তের গ্রামের নাম কী? ",
            "৫. স্কুলজীবন শেষে মাইকেল মধুসূদন দত্ত কোথায় ভর্তি হন?",
            "৬. হিন্দু কলেজে অধ্যয়নকালে কোন বিষয়ের প্রতি মাইকেল মধুসূদন দত্তের তীব্র আবেগ জন্ম নেয়?",
            "৭. মাইকেল মধুসূদন দত্ত কত সালে খ্রিষ্টধর্মে দীক্ষিত হন? ",
            "৮. কখন মধুসূদন দত্তের নামের আগে মাইকেল যুক্ত হয়?",
            "৯. পাশ্চাত্যের জীবনযাপনের প্রতি তীব্র আকাঙক্ষা মাইকেল মধুসূদন দত্তকে কোন ভাষায় সাহিত্য রচনায় উদ্বুদ্ধ করে?",
            "১০. কোন ভাষায় কাব্য রচনার মধ্য দিয়ে মাইকেল মধুসূদন দত্তের প্রতিভার যথার্থ বিকাশ ঘটে? ",
            "১১. কোনটি মাইকেল মধুসূদন দত্তের অমর কীর্তি?",
            "১২. ‘কৃষ্ণকুমারী’ মাইকেল মধুসূদন দত্তের কী ধরনের রচনা?",
            "১৩. মাইকেল মধুসূদন দত্ত রচিত নাটক কোনটি? ",
            "১৪. কোনটি মাইকেল মধুসূদন দত্তের লেখা প্রহসন? ",
            "১৫. বাংলা কাব্যে অমিত্রাক্ষর ছন্দের প্রবর্তক কে? ",
            "১৬. বাংলা কাব্যে ‘সনেট’ প্রবর্তন করেন কে? ",
            "১৭. মাইকেল মধুসূদন দত্ত কত খ্রিষ্টাব্দে মৃত্যুবরণ করেন?",
            "১৮. মাইকেল মধুসূদন দত্তের সর্বদা কার কথা মনে পড়ে?",
            "১৯. মাইকেল মধুসূদন দত্ত সর্বদা কিসের কলকল ধ্বনি শুনতে পান?",
            "২০. ‘কপোতাক্ষ নদ’ কবিতায় কপোতাক্ষকে কী বলা হয়েছে? ",
            "২১. কোনটি মধুসূদন দত্ত ভ্রান্তির ছলনে শোনেন?",
            "২২. কপোতাক্ষ নদ মধুসূদন দত্তের কী মেটায়?",
            "২৩. কপোতাক্ষের কলকল শব্দ কিসের মতো?",
            "২৪. ‘কপোতাক্ষ নদ’ কবিতায় ‘প্রজা’ বলা হয়েছে কাকে?",
            "২৫. ‘কপোতাক্ষ নদ’ কবিতায় কপোতাক্ষ নদ প্রজারূপে কাকে বারিরূপ কর দিতে যায়?",
            "২৬. কপোতাক্ষ নদ সাগরকে কর হিসেবে কী দেয়?",
            "২৭. ‘কপোতাক্ষ নদ’ কবিতায় কবির কেমন মনোভাব প্রকাশিত হয়েছে? ",
            "২৮. কপোতাক্ষ নদের কাছে মধুসূদন দত্তের মিনতি কী?",
            "২৯. ‘কপোতাক্ষ নদ’ কবিতায় কবির সংশয় প্রকাশিত হয়েছে কোন বিষয়ে? ",
            "৩০. মধুসূদন দত্ত বঙ্গের সংগীতে কার নাম স্মরণ করেন? "



    };
    public static String myChoices[][] = {

            {" ক. রবীন্দ্রনাথ ঠাকুর",  "খ. হেমচন্দ্র বন্দ্যোপাধ্যায়",  "গ. মাইকেল মধুসূদন দত্ত",  "ঘ.  গীবনানন্দ দাশ"},
            {"ক. ২২শে মার্চ ১৮১৯",  "খ. ২৫শে জানুয়ারি ১৮২৪",  "গ. ২৬শে জুন ১৮৪২",  "ঘ ২৮শে নভেম্বর ১৮৪৪"},
            {"ক পাবনা",  "খ. বরিশাল",  " গ. রাজশাহী",  "ঘ যশোর"},
            {"ক. নিমতা",  "খ. পেঁড়ো",  "গ. কাঞ্চনপুর",  "ঘ সাগরদাঁড়ি"},
            {"ক. প্রেসিডেন্সি কলেজে",  "খ. সংস্কৃত কলেজে",  "গ. হিন্দু কলেজে",  "ঘ. কলকাতা কলেজে"},
            {"ক. বাংলা সাহিত্য",  "খ. ইংরেজি সাহিত্য",  "গ. সংস্কৃত সাহিত্য",  " ঘ ফরাসি সাহিত্য"},
            {"ক. ১৮২৪",  "খ. ১৮৩২",  "গ. ১৮৪২",  " ঘ ১৮৪৮"},
            {"ক. খ্রিষ্ট ধর্ম গ্রহণের পর",  "খ. ফ্রান্সে যাওয়ার পর",  "গ. ইংরেজি কবিতা লেখার পর",  "ঘ ইংরেজ নারীকে বিয়ের পর"},
            {"ক. ইংরেজি ভাষায়",  "খ. ফরাসি ভাষায়",  "গ. পর্তুগিজ ভাষা",  "ঘ. গ্রিক ভাষায়"},
            {"ক. ইংরেজি",  "খ. বাংলা",  "গ. সংস্কৃত",  "ঘ ফরাসি"},
            {" ক. দিবারাত্রির কাব্য",  "খ. মেঘনাদবধ কাব্য",  "গ. দুঃখী জননীর কাব্য",  "ঘ. ত্রয়োদশপদী কাব্য"},
            {"ক. কাব্য",  "খ. উপন্যাস",  "গ. প্রহসন",  "ঘ নাটক"},
            {" ক. ব্রজাঙ্গনা",  " খ. পদ্মাবতী",  "গ. বুড় সালিকের ঘাড়ে রোঁ",  "ঘ তিলোত্তমাসম্ভব"},
            {"ক. তিলোত্তমাসম্ভব কাব্য",  " খ. একেই কি বলে সভ্যতা",  "গ. কৃষ্ণকুমারী",  "ঘ. শর্মিষ্ঠা"},
            {"ক. মাইকেল মধুসূদন দত্ত",  "খ. রবীন্দ্রনাথ ঠাকুর",  "গ. জীবনানন্দ দাশ ",  "ঘ ভারতচন্দ্র রায়গুণাকর"},
            {"ক. রবীন্দ্রনাথ ঠাকুর",  "খ. জীবনানন্দ দাশ",  "গ. মাইকেল মধুসূদন দত্ত ",  "ঘ. সত্যেন্দ্রনাথ দত্ত"},
            {"ক. ১৮৪৩ খ্রিষ্টাব্দে",  "খ. ১৮৫৩ খ্রিষ্টাব্দে",  "গ. ১৮৬৩ খ্রিষ্টাব্দে",  "ঘ. ১৮৭৩ খ্রিষ্টাব্দে"},
            {"ক. মায়ের কথা",  "খ. কপোতাক্ষ নদের কথা",  "গ. সন্তানের কথা",  " ঘ. পিতার কথা"},
            {"ক. স্বদেশের নদের স্রোতধারার",  " খ. স্বদেশের দিঘির স্রোতধারার",  "গ. বিদেশের নদীর স্রোতধারার",  "ঘ. বিদেশের সমুদ্রের স্রোতধারার"},
            {"ক. গরল স্রোতোরূপী",  "খ. অমৃত স্রোতোরূপী",  "গ. দুগ্ধ স্রোতোরূপী",  "ঘ. মধুস্রোতোরূপী"},
            {"ক. ছুটে যাওয়া ট্রেনের ধ্বনি",  " খ. কপোতাক্ষের স্রোতধ্বনি",  "গ. শিশুদের আনন্দধ্বনি",  "ঘ. ঢোলের বাদ্যধ্বনি"},
            {"ক. অর্থের চাহিদা",  "খ. জলের তৃষ্ণা",  "গ. পুষ্টির চাহিদা",  "ঘ. স্নেহের তৃষ্ণা"},
            {"ক. নিশার স্বপনের মতো",  "খ. মায়া-মন্ত্রধ্বনির মতো",  "গ. অমিত্রাক্ষর ছন্দের মতো",  "ঘ. ভ্রান্তির ছলনের মতো"},
            {"ক. কবিকে",  "খ. সাগরকে",  "গ. বাংলার মানুষকে",  " ঘ. কপোতাক্ষ নদকে"},
            {" ক. কবিকে",  "খ. বাংলার মানুষকে",  "গ. সাগরকে",  "ঘ. হ্রদকে"},
            {"ক. জল",  "খ. দুগ্ধ",  " গ. মধু",  "ঘ. গরল"},
            {"ক. হতাশার মনোভাব",  "খ. স্বদেশপ্রেমের অনুভূতি",  "গ. তীব্র অভিমান",  "ঘ. প্রবল প্রতিবাদ"},
            {"ক. তাঁকে যেন মনে রাখে",  "খ. সাগরে যেন না মেশে",  "গ. তাঁকে যেন ভুলে যায়",  "ঘ. স্বপ্নে যেন দেখা দেয়"},
            {"ক. বেঁচে থাকার বিষয়ে",  "খ. সাহিত্যচর্চার বিষয়ে",  "গ. স্বদেশে ফেরার বিষয়ে",  "ঘ. দেশপ্রেমের বিষয়ে"},
            {"ক. সাগরদাঁড়ির নাম",  "খ. মায়ের নাম",  "গ. কপোতাক্ষ নদের নাম",  "ঘ. গুরুর নাম"}


    };  public static String myCorrectAnswer[] = {

            "গ. মাইকেল মধুসূদন দত্ত",
            "খ. ২৫শে জানুয়ারি ১৮২৪",
            "ঘ যশোর",
            "ঘ সাগরদাঁড়ি",
            "গ. হিন্দু কলেজে",
            "খ. ইংরেজি সাহিত্য",
            "গ. ১৮৪২",
            "ক. খ্রিষ্ট ধর্ম গ্রহণের পর",
            "ক. ইংরেজি ভাষায়",
            "খ. বাংলা",
            "খ. মেঘনাদবধ কাব্য",
            "ঘ নাটক",
            " খ. পদ্মাবতী",
            " খ. একেই কি বলে সভ্যতা",
            "ক. মাইকেল মধুসূদন দত্ত",
            "গ. মাইকেল মধুসূদন দত্ত ",
            "ঘ. ১৮৭৩ খ্রিষ্টাব্দে",
            "খ. কপোতাক্ষ নদের কথা",
            "ক. স্বদেশের নদের স্রোতধারার",
            "গ. দুগ্ধ স্রোতোরূপী",
            " খ. কপোতাক্ষের স্রোতধ্বনি",
            "ঘ. স্নেহের তৃষ্ণা",
            "খ. মায়া-মন্ত্রধ্বনির মতো",
            " ঘ. কপোতাক্ষ নদকে",
            "গ. সাগরকে",
            "ক. জল",
            "খ. স্বদেশপ্রেমের অনুভূতি",
            "ক. তাঁকে যেন মনে রাখে",
            "গ. স্বদেশে ফেরার বিষয়ে",
            "গ. কপোতাক্ষ নদের নাম"



    };



}
