package com.soft.mcqbanglabook;

public class ManusMohammadQNA {

    public static String myQuestion[] ={
            "১. মোহাম্মদ ওয়াজেদ আলী কত খ্রিষ্টাব্দে জন্মগ্রহণ করেন?",
            "২. মোহাম্মদ ওয়াজেদ আলী কোথায় জন্মগ্রহণ করেন?",
            "৩. বি.এ ক্লাসের ছাত্র থাকাকালীন মোহাম্মদ ওয়াজেদ আলী কোন আন্দোলনে যোগদান করেন?",
            "৪. মোহাম্মদ ওয়াজেদ আলী কোন ক্লাসের ছাত্র থাকাকালীন লেখাপড়ার সমাপ্তি ঘটান?",
            "৫. মোহাম্মদ ওয়াজেদ আলী পেশা হিসেবে কোনটি গ্রহণ করেন?",
            "৬. মোহাম্মদ ওয়াজেদ আলী কোন পত্রিকায় কর্মরত ছিলেন?",
            "৭. স্বাস্থ্যগত কারণে মোহাম্মদ ওয়াজেদ আলী কত সালে কলকাতা ছেড়ে সাতক্ষীরায় চলে আসেন?",
            "৮. মোহাম্মদ ওয়াজেদ আলী কত সালে মৃত্যুবরণ করেন?",
            "৯. শেষ পর্যন্ত মুহম্মদ (স.)-এর মৃত্যুশয্যার পাশে ছিলেন কে?",
            "১০. আবু বকর (রা.) কাকে অবিনশ্বর বলেছেন?",
            "১১. হযরত মুহম্মদ (স.) মানুষের মন আকর্ষণ করেছিলেন কী দ্বারা?",
            "১২. মক্কা থেকে মদিনায় হিজরতের পথে মুহম্মদ (স.) কার কুটিরে আশ্রয় নেন?",
            "১৩. রাহী-পথিকদের সেবা করা কাদের ব্রত ছিল?",
            "১৪. হিজরতের পথে মুহম্মদ (স.) আবু মাবদের ঘরে আশ্রয় নিলে আবু মাবদ কোথায় ছিলেন?",
            "১৫. মুহম্মদ (স.) আশ্রয় গ্রহণ করলে উম্মে মাবদ কী দিয়ে হযরতের তৃষ্ণা নিবারণ করেন?",
            "১৬. ‘মানুষ মুহম্মদ (স.)’ প্রবন্ধে আবু মাবদ বাসায় ফিরলে স্ত্রী তার কাছে কী বর্ণনা করেন?",
            "১৭. কিসের নিবিড় সাধনায় মুহম্মদ (স.)-এর চরিত্র মধুময় হয়ে উঠেছিল?",
            "১৮. কে সবচেয়ে বেশি সুদর্শন পুরুষ ছিলেন?",
            "১৯. কোথায় সত্য প্রচার করতে গিয়ে মুহম্মদ (স.) প্রস্তরাঘাতে জর্জরিত হয়েছিলেন?",
            "২০. মুহম্মদ (স.) মদিনায় হিজরত করলেন কেন?",
            "২১. কোন যুদ্ধে মুহম্মদ (স.)-এর মিথ্যা পরাজয়ের সংবাদ শুনে কাফেররা আনন্দে আত্মহারা হয়েছিল?",
            "২২. পথিমধ্যে কাকে হত্যা করার জন্য মক্কার কাফেররা শত শত ঘাতক পাঠায়?",
            "২৩. মুহম্মদ (স.)-এর মক্কা বিজয়ের দিন কাফেররা খালিদের সাথে হাঙ্গামা বাধিয়ে দিল কেন?",
            "২৪. মক্কা বিজয়ের পর মুহম্মদ (স.) কাফেরদের প্রতি কোনটি করেছিলেন?",
            "২৫. কোনটির মাধ্যমে মুহম্মদ (স.)-এর মনুষ্যত্বের সুমহান প্রকাশ ঘটেছে?",
            "২৬. হযরত মুহম্মদ (স.) মুহূর্তের জন্যও তাঁর অন্তরে কোনটিকে স্থান দেননি?",
            "২৭. বক্তৃতার মাঝখানে মুহম্মদ (স.)-কে প্রশ্ন করে থামিয়েছিল কে?",
            "২৮. অন্ধ ব্যক্তিটি প্রশ্ন করায় মুহম্মদ (স.)-এর ললাট সামান্য কুঞ্চিত হলো কেন?",
            "২৯. হুদায়বিয়ার সন্ধি মুসলমানদের জন্য কেমন ছিল?",
            "৩০. মুহম্মদ (স.)-এর মৃত্যুর পর কার গম্ভীর উক্তিতে সকলের চৈতন্য হলো?"



    };




    public static String myChoices[][] = {

            {"ক. ১৮৯৬ খ্রিষ্টাব্দে",  "খ. ১৮৯৭ খ্রিষ্টাব্দে",  "গ. ১৮৯৮ খ্রিষ্টাব্দে",  "ঘ. ১৮৯৯ খ্রিষ্টাব্দে"},
            {" ক. ফরিদপুর",  " খ. সাতক্ষীরা",  "গ. বরিশাল",  "ঘ. পাবনা"},
            {" ক. স্বদেশি আন্দোলনে",  "খ. সিপাহি বিদ্রোহে",  " গ. দেশভাগ আন্দোলনে",  "ঘ. অসহযোগ আন্দোলনে"},
            {"ক. দশম শ্রেণি",  "খ. বি.এ",  "গ. এফ.এ",  " ঘ. এম.এ."},
            {"ক. শিক্ষকতা",  "খ. আইন ব্যবসা",  "গ. সাংবাদিকতা",  "ঘ. ব্যবসায়"},
            {"ক. মাসিক মোহাম্মদী",  " খ. ইত্তেফাক",  " গ. ধূমকেতু",  " ঘ. লাঙল"},
            {"ক. ১৯৩০ সালে",  "খ. ১৯৩৫ সালে",  "গ. ১৯৪০ সলে",  " ঘ. ১৯৪৫ সালে"},
            {"ক. ১৯৫১ সালে",  "খ. ১৯৫২ সালে",  "গ. ১৯৫৩ সালে",  "ঘ. ১৯৫৪ সালে"},
            {"ক. আবু বকর (রা.)",  "খ. উমর (রা.)",  " গ. উসমান (রা.)",  "ঘ. আলী (রা.)"},
            {"ক. আল্লাহকে",  "খ. হযরত মুহম্মদ (স.)-কে",  " গ. উমর (রা.)-কে",  "ঘ. আয়েশা (রা.)-কে"},
            {"ক. বংশমর্যাদা দ্বারা",  "খ. মানবীয় গুণাবলি দ্বারা",  "গ. ক্ষমতা দ্বারা",  "ঘ. শক্তি দ্বারা "},
            {"ক. আবু বকরের",  "খ. আবু মা’বদের",  "গ. উসমান (রা.)-এর",  "ঘ. উমাইর (রা.)-এর"},
            {"ক. আবু মাবদ দম্পতির",  "খ. মক্কাবাসীর",  "গ. মদিনার মুসলমানদের",  "ঘ. তায়েফবাসীর"},
            {"ক. বাজারে ছিলেন",  " খ. মেষপাল চরাতে গিয়েছিলেন",  "গ. মক্কায় ছিলেন",  "ঘ. মদিনায় গিয়েছিলেন"},
            {"ক. পানি দিয়ে",  "খ. শরবত দিয়ে",  "গ. খাগীদুগ্ধ দিয়ে",  "ঘ. উষ্ট্রদুগ্ধ দিয়ে"},
            {"ক. মুহম্মদ (স.)-এর হিযরতের কাহিনি",  "খ. মুহম্মদ (স.)-এর রূপের কথা",  "গ. মুহম্মদ (স.)-এর মানবীয় গুণের কথা",  "ঘ. মুহম্মদ (স.)-এর প্রচারিত ধর্মের কথা"},
            {"ক. ধর্মবোধের",  "খ. সত্যের",  "গ. রূপমাধুর্যের",  "ঘ. ইসলামের"},
            {"ক. আবু বকর (রা.)",  "খ. উমর (রা.)",  "গ. আবু মাবদ",  "ঘ. মুহম্মদ (স.)"},
            {"ক. মক্কায়",  "খ. মদিনায়",  "গ. তায়েফে",  "ঘ. গেদ্দায়"},
            {"ক. মক্কাবাসীদের নির্যাতনের মাত্রা সহনাতীত হলে✓",  "খ. মদিনায় অনেক ধন-সম্পদ লাভের আশায়",  "গ. যুদ্ধের জন্য সৈন্য সংগ্রহ করতে",  "ঘ. মদিনার গভর্নর হওয়ার জন্য"},
            {" ক. বদরের যুদ্ধে",  " খ. ওহোদের যুদ্ধে",  "গ. খন্দকের যুদ্ধে",  "ঘ. খয়বরের যুদ্ধে"},
            {"ক. মুহম্মদ (স.)-কে",  "খ. উমর (রা)-কে",  " গ. আবু মাবদকে",  "ঘ. উসমান (রা)-কে"},
            {"ক. যুদ্ধ করার অভিপ্রায়ে",  "খ. খালিদ প্রতারণা করার কারণে",  "গ. খালিদ ইসলাম গ্রহণ করায়",  "ঘ. মুহম্মদ (স.)-কে হত্যা করার জন্য"},
            {"ক. প্রতিশোধ নিয়েছিলেন",  "খ. ক্ষমা করেছিলেন",  "গ. বিদ্বেষমূলক বক্তব্য দিয়েছিলেন",  " ঘ. ইসলাম গ্রহণে বাধ্য করেছিলেন"},
            {"ক. বদর যুদ্ধ",  "খ. মদিনায় হিজরত",  "গ. তায়েফে রক্তাক্ত হওয়া",  "ঘ. মক্কা বিজয়ের পর কাফেরদের ক্ষমা করা"},
            {"ক. বংশগৌরব",  "খ. মদিনায় যাওয়ার কথা",  "গ. দয়া ও ভালোবাসা",  "ঘ. কঠোরতা"},
            {"ক. আবু বকর (রা.)",  "খ. উমর (রা.)",  "গ. গনৈক পথচারী",  " ঘ. গনৈক অন্ধ"},
            {" ক. রাগে",  "খ. দুঃখে",  "গ. বিরক্তিতে",  "ঘ. ঘৃণায়"},
            {"ক. অপমানের",  "খ. গৌরবের",  "গ. লাভজনক",  "ঘ. প্রতিশোধের"},
            {"ক. উমর (রা.)-এর",  "খ. আবু বকর (রা.)-এর",  "গ. আয়েশা (রা.)-এর",  "ঘ. উসমান (রা.)-এর"}


    };

    public static String myCorrectAnswer[] = {

            "ক. ১৮৯৬ খ্রিষ্টাব্দে",
            " খ. সাতক্ষীরা",
            "ঘ. অসহযোগ আন্দোলনে",
            "খ. বি.এ",
            "গ. সাংবাদিকতা",
            "ক. মাসিক মোহাম্মদী",
            "খ. ১৯৩৫ সালে",
            "ঘ. ১৯৫৪ সালে",
            "ক. আবু বকর (রা.)",
            "ক. আল্লাহকে",
            "খ. মানবীয় গুণাবলি দ্বারা",
            "খ. আবু মা’বদের",
            "ক. আবু মাবদ দম্পতির",
            " খ. মেষপাল চরাতে গিয়েছিলেন",
            "গ. খাগীদুগ্ধ দিয়ে",
            "খ. মুহম্মদ (স.)-এর রূপের কথা",
            "খ. সত্যের",
            "ঘ. মুহম্মদ (স.)",
            "গ. তায়েফে",
            "ক. মক্কাবাসীদের নির্যাতনের মাত্রা সহনাতীত হলে✓",
            "ঘ. খয়বরের যুদ্ধে",
            "ক. মুহম্মদ (স.)-কে",
            "ক. যুদ্ধ করার অভিপ্রায়ে",
            "খ. ক্ষমা করেছিলেন",
            "ঘ. মক্কা বিজয়ের পর কাফেরদের ক্ষমা করা",
            "ক. বংশগৌরব",
            " ঘ. গনৈক অন্ধ",
            "গ. বিরক্তিতে",
            "ক. অপমানের",
            "খ. আবু বকর (রা.)-এর"


    };




}
