package com.soft.mcqbanglabook;

public class MomotadiQNA {

    public static String myQuestion[] ={
            "১. মানিক বন্দ্যোপাধ্যায় কত সালে জন্মগ্রহণ করেন?",
            "২. মানিক বন্দ্যোপাধ্যায়ের জন্মস্থান কোথায়?",
            "৩. মানিক বন্দ্যোপাধ্যায়ের আসল নাম কী?",
            "৪. মানিক বন্দ্যোপাধ্যায়ের পিতার নাম কী?",
            "৫. মানিক বন্দ্যোপাধ্যায়ের মায়ের নাম কী?",
            "৬. মানিক বন্দ্যোপাধ্যায়ের পৈতৃক বাড়ি কোথায় ছিল?",
            "৭. মানিক বন্দ্যোপাধ্যায় কত সালে ম্যাট্রিক পাস করেন?",
            "৮. মানিক বন্দ্যোপাধ্যায় গণিতে অনার্স নিয়ে কোথায় ভর্তি হন?",
            "৯. মানিক বন্দ্যোপাধ্যায় বন্ধুদের সাথে বাজি ধরে কোন গল্প রচনা করেন?",
            "১০. মানিক বন্দ্যোপাধ্যায়ের ‘অতসীমামী’ নামক গল্পটি সর্বপ্রথম কোন পত্রিকায় প্রকাশিত হয়?",
            "১১. কোন গল্পের মাধ্যমে লেখক হিসেবে মানিক বন্দ্যোপাধ্যায়ের নিয়তি নির্ধারিত হয়?",
            "১২. মানিক বন্দ্যোপাধ্যায়ের অনার্স পাস করা হয়নি কেন?",
            "১৩. কে লেখালেখিকেই জীবিকার একমাত্র উপায় হিসেবে গ্রহণ করেন?",
            "১৪. মানিক বন্দ্যোপাধ্যায় কতটি উপন্যাস রচনা করেন?",
            "১৫. মানিক বন্দ্যোপাধ্যায় কত সালে মৃত্যুবরণ করেন?",
            "১৬. ‘মমতাদি’ গল্পে বর্ণিত গৃহকর্মীটির নাম কী?",
            "১৭. ‘মমতাদি’ গল্পে কাজের খোঁজে আসা মেয়েটি কখন এসেছিল?",
            "১৮. মমতাদি কাজ খুঁজতে আসার সময় কোন ঋতু বিরাজ করছিল?",
            "১৯. ‘মমতাদি’ গল্পে সংকোচ একেবারেই হারিয়ে ফেলেছে কে?",
            "২০. মমতাদির বয়স কত বলে অনুমিত হয়?",
            "২১. মমতাদি কপালের ক্ষত চিহ্নটি স্কুলপড়ুয়া ছেলেটির কাছে কী মনে হয়?",
            "২২. মমতাদি রান্না ছাড়াও আর কী করতে চায়?",
            "২৩. মমতাদি কোথায় থাকে?",
            "২৪. বাসায় মমতাদির কয়টি ছেলেমেয়ে আছে?",
            "২৫. মমতাদির স্বামীর কয় মাস যাবৎ চাকরি নেই?",
            "২৬. মমতাদি মর্যদাসম্পন্ন ঘরের নারী হয়েও ঝিয়ের কাজ করতে এসেছে কেন?",
            "২৭. পনেরো টাকা বেতন ঠিক করায় মমতাদির দুচোখ সজল হয়ে উঠল কেন?",
            "২৮. মমতাদি কত টাকা বেতন আশা করেছিল?",
            "২৯. সকলে মমতাদির কোন গুণ দেখে খুশি হলো?",
            "৩০. মমতাদি কাজ করতে গিয়ে কাজের উপদেশ না পেলে কী করতেন?"



    };


    public static String myChoices[][] = {

            {"ক. ১৯০৫",  "খ. ১৯০৬",  "গ. ১৯০৭",  "ঘ. ১৯০৮"},
            {" ক. তাম্বুলখানা",  "খ. চব্বিশ পরগনা",  "গ. সাঁওতাল পরগনা",  "ঘ. হুগলি"},
            {"ক. মহানন্দ বন্দ্যোপাধ্যায়",  "খ. হরিহর বন্দ্যোপাধ্যায়",  "গ. প্রবোধ কুমার বন্দ্যোপাধ্যায়",  "ঘ. গণেশ বন্দ্যোপাধ্যায়"},
            {"ক. হরিহর বন্দ্যোপাধ্যায়",  "খ. হেমচন্দ্র বন্দ্যোপাধ্যায়",  "গ. নীলচন্দ্র বন্দ্যোপাধ্যায়",  "ঘ. রঙ্গলাল বন্দ্যোপাধ্যায়"},
            {"ক. স্বর্ণকুমারী দেবী",  "খ. কুসুমকুমারী দেবী",  "গ. নীরদাসুন্দরী দেবী",  "ঘ. অন্নদাসুন্দরী দেবী"},
            {"ক. জামালপুর",  "খ. কুমিল্লা",  "গ. মুন্সীগঞ্জ ",  "ঘ. মেদিনীপুর"},
            {"ক. ১৯২৪ সালে",  "খ. ১৯২৬ সালে",  "গ. ১৯২৮ সালে",  "ঘ. ১৯৩০ সালে"},
            {"ক. আলীগড় বিশ্ববিদ্যালয়ে",  "খ. কলকাতা বিশ্ববিদ্যালয়ে",  "গ. কলকাতা প্রেসিডেন্সি কলেজে ",  "ঘ. ফোর্ট উইলিয়াম কলেজে"},
            {"ক. মমতাদি",  "খ. অতসীমামী ",  "গ. প্রাগৈতিহাসিক",  "ঘ. চিহ্ন"},
            {"ক. বিচিত্রা ",  "খ. বিজলী",  "গ. শিখা",  "ঘ. বিশ্বভারতী"},
            {"ক. প্রাগৈতিহাসিক",  "খ. অতসীমামী",  "গ. মমতাদি",  "ঘ. বড়দিদি"},
            {"ক. দারিদ্র্যের কারণে",  "খ. পরীক্ষায় ফেল করায়",  "গ. লেখালেখিতে মগ্ন থাকায়",  "ঘ. পরিবারের চাপে"},
            {"ক. রবীন্দ্রনাথ ঠাকুর",  "খ. মানিক বন্দ্যোপাধ্যায় ",  "গ. সঞ্জীবচন্দ্র চট্টোপাধ্যায়",  "ঘ. রণেশ দাশগুপ্ত"},
            {"ক. বিশটি",  "খ. ত্রিশটি",  "গ. চল্লিশটি",  "ঘ. পঞ্চাশটির অধিক"},
            {"ক. ১৯৫৪ সালে",  "খ. ১৯৫৫ সালে",  "গ. ১৯৫৬ সালে ",  "ঘ. ১৯৫৭ সালে"},
            {"ক. মমতা ",  "খ. মমতাজ",  "গ. মনি",  "ঘ. মল্লিকা"},
            {"ক. সকালে",  "খ. দুপুরে",  "খ. দুপুরে",  "ঘ. সন্ধ্যায়"},
            {"ক. গ্রীষ্মকাল",  "খ. বর্ষাকাল",  "গ. শীতকাল ",  "ঘ. বসন্তকাল"},
            {"ক. স্কুলপড়ুয়া ছেলেটি",  "খ. মমতাদি ",  "গ. বাড়ির কর্ত্রী",  "ঘ. মমতার স্বামী"},
            {"ক. বিশ",  "খ. তেইশ",  "গ. ত্রিশ",  "ঘ. তেত্রিশ"},
            {"ক. ভয়ংকর এক গর্ত",  "খ. চামড়া ওঠা ঘা",  "গ. আন্দাজে পরা টিপ",  "ঘ. সাদা রঙের প্রলেপ"},
            {"ক. শিশুদের দেখাশোনা",  "খ. ছোট ছোট কাজ",  "গ. কাপড়-চোপড় ধোয়া",  "ঘ. গবাদিপশু পালন"},
            {"ক. জীবনময়ের গলিতে ",  "খ. ভুবনময়ের গলিতে",  "গ. মুখুয্যেবাড়িতে",  "ঘ. লেখকের বাড়িতে"},
            {"ক. একটি",  "খ. দুইটি",  "গ. তিনটি",  "ঘ. চারটি"},
            {"ক. এক মাস",  "খ. দুই মাস",  "গ. তিন মাস",  "ঘ. চার মাস"},
            {"ক. স্বামীর অত্যাচারে",  "খ. টাকার লোভে",  "গ. অভাবের তাড়নায় ",  "ঘ. স্কুলপড়ুয়া ছেলেটির প্রতি ভালোবাসায়"},
            {"ক. কম বেতন নির্ধারণ করায়",  "খ. আশাতিরিক্ত বেতন নির্ধারণ করায় ",  "গ. এই বেতনে সংসার চালানো কঠিন ভেবে",  "ঘ. এই বেতনে তার স্বামী কাজ করতে দেবে না ভেবে"},
            {"ক. আট টাকার মতো",  "খ. দশ টাকার মতো",  "গ. বারো টাকার মতো",  "ঘ. চৌদ্দ টাকার মতো"},
            {"ক. কাজের শৃঙ্খলা ও ক্ষিপ্রতা",  "খ. বাকপটুতা",  "গ. শিশুদের প্রতি মমতা",  "ঘ. গৃহকর্ত্রীর প্রতি আনুগত্য"},
            {"ক. বসে থাকতেন",  "খ. নিজের বুদ্ধি খাটিয়ে করতেন",  "গ. বাড়ির গিন্নির কাছে যেতেন",  "ঘ. কর্তাকে জিজ্ঞেস করতেন"}


    };



    public static String myCorrectAnswer[] = {

            "ঘ. ১৯০৮",
            "গ. সাঁওতাল পরগনা",
            "গ. প্রবোধ কুমার বন্দ্যোপাধ্যায়",
            "ক. হরিহর বন্দ্যোপাধ্যায়",
            "গ. নীরদাসুন্দরী দেবী",
            "গ. মুন্সীগঞ্জ ",
            "খ. ১৯২৬ সালে",
            "গ. কলকাতা প্রেসিডেন্সি কলেজে ",
            "খ. অতসীমামী ",
            "ক. বিচিত্রা ",
            "খ. অতসীমামী",
            "গ. লেখালেখিতে মগ্ন থাকায়",
            "খ. মানিক বন্দ্যোপাধ্যায় ",
            "ঘ. পঞ্চাশটির অধিক",
            "গ. ১৯৫৬ সালে ",
            "ক. মমতা ",
            "ক. সকালে",
            "গ. শীতকাল ",
            "খ. মমতাদি ",
            "খ. তেইশ",
            "গ. আন্দাজে পরা টিপ",
            "খ. ছোট ছোট কাজ",
            "ক. জীবনময়ের গলিতে ",
            "ক. একটি",
            "ঘ. চার মাস",
            "গ. অভাবের তাড়নায় ",
            "খ. আশাতিরিক্ত বেতন নির্ধারণ করায় ",
            "গ. বারো টাকার মতো",
            "ক. কাজের শৃঙ্খলা ও ক্ষিপ্রতা",
            "খ. নিজের বুদ্ধি খাটিয়ে করতেন"


    };



}
