package com.soft.mcqbanglabook;

public class NimGasQNA {


    public static String myQuestion[] ={
            "১. নিমগাছের ছাল নিয়ে লোকজন কী কাজে লাগায়? ",
            "২. বলাইচাঁদ মুখোপাধ্যায় কত সালে জন্মগ্রহণ করেন?",
            "৩. বলাইচাঁদ মুখোপাধ্যায়ের জন্মস্থান কোনটি?",
            "৪. বনফুল কোন গ্রামে জন্মগ্রহণ করেন?",
            "৫. বনফুলের পিতার নাম কী?",
            "৬. বনফুল কোন বিদ্যালয় থেকে ম্যাট্রিক পাস করেন?",
            "৭. বনফুল কত সালে ম্যাট্রিক পাস করেন?",
            "৮. বনফুল কত সালে আই.এসসি পাস করেন?",
            "৯. বনফুল কত সালে এম.বি পাস করেন?",
            "১০. বনফুল কোথা থেকে আই.এসসি পাশ করেন?",
            "১১. বনফুল কোন প্রতিষ্ঠান থেকে এম.বি পাশ করেন?",
            "১২. কী হিসেবে চাকরির মাধ্যমে বনফুলের কর্মজীবনের সূচনা ঘটে?",
            "১৩. কত সালে বনফুলের লেখা প্রথম প্রকাশিত হয়?",
            "১৪. নিচের কোনটির মাধ্যমে বনফুলের সাহিত্য-অঙ্গনে আত্মপ্রকাশ ঘটে?",
            "১৫. কী ধরনের লেখালেখির ভেতর দিয়ে বনফুলের সাহিত্য-অঙ্গনে প্রবেশ ঘটে?",
            "১৬. কোনটি বলাইচাঁদ মুখোপাধ্যায়ের রচিত গ্রন্থ?",
            "১৭. নিচের কোনটি বনফুলের লেখা গল্পগ্রন্থ?",
            "১৮. কোনটি বনফুলের লেখা জীবনী নাটক?",
            "১৯. বলাইচাঁদ মুখোপাধ্যায় কোন উপাধি লাভ করেন?",
            "২০. বনফুল কত সালে মৃত্যুবরণ করেন?",
            "২১. বনফুলের মৃত্যুস্থান কোনটি?",
            "২২. ‘নিমগাছ’ গল্পে কী সিদ্ধ করার কথা উল্লেখ আছে?",
            "২৩. নিমের কোন অংশ শিলে পেষার কথা বলা হয়েছে নিমগাছ গল্পে?",
            "২৪. নিমের কোন অংশ খোস দাদ হাজা চুলকানিতে লাগানো হবে?",
            "২৫. নিমের পাতা কোনটির অব্যর্থ মহৌষধ?",
            "২৬. উপকার পাওয়ার জন্য নিমের কোন অংশটি অনেকে কাঁচা খায়?",
            "২৭. নিমের পাতা ভেজে কিসের সাথে খাওয়া হয়?",
            "২৮. যকৃতের জন্য উপকারী কোনটি?",
            "২৯. নিমের কোন অংশটি অনেকে চিবিয়ে থাকে?",
            "৩০. নিমের কচি ডাল চিবোলে কী উপকার পাওয়া যায়?"



    };


    public static String myChoices[][] = {

            {"(ক) সিদ্ধ করে খায়",  "(খ) ভানুসিংহ",  "(গ) বনফুল",  " (ঘ) মতিহার"},
            {"(ক) ১৮৫৯ সালে",  "(খ) ১৮৭৯ সালে",  "(গ) ১৮৯৯ সালে ",  "(ঘ) ১৯১৯ সালে"},
            {"(ক) পশ্চিমবঙ্গের চব্বিশ পরগণা",  "(খ) বিহারের পূর্ণিয়া ",  "(গ) কলকাতার জোড়াসাঁকো",  "(ঘ) হুগলি জেলার ভুরশুট পরগণা"},
            {"(ক) মৌড়া",  "(খ) নিমতা",  "(গ) সাগরদাঁড়ি",  "(ঘ) মণিহার "},
            {"(ক) শরদিন্দু বন্দ্যোপাধ্যায়",  " (খ) শ্রীজিত চট্টোপাধ্যায়",  "(গ) সত্যনারায়ণ মুখোপাধ্যায়",  "(ঘ) অরবিন্দ গঙ্গোপাধ্যায়"},
            {" (ক) সাহেবগঞ্জ ইংরেজি উচ্চ বিদ্যালয়",  "(খ) মেদিনীপুর জেলা স্কুল",  "(গ) সেন্টগ্রেগরিজ হাই স্কুল",  "(ঘ) খিদিরপুর বাংলা স্কুল"},
            {"(ক) ১৯০৮",  "(খ) ১৯১৮ ",  "(গ) ১৯২৮",  "(ঘ) ১৯৩৮"},
            {"(ক) ১৯১০",  "(খ) ১৯১৮",  "(গ) ১৯২০",  "(ঘ) ১৯২৮"},
            {"(ক) ১৯১৮",  "(খ) ১৯২০",  "(গ) ১৯২৫",  "(ঘ) ১৯২৭ "},
            {"(ক) রিপন কলেজ",  "(খ) সংস্কৃত কলেজ",  "(গ) হুগলি কলেজ",  "(ঘ) সেন্ট কলম্বাস কলেজ "},
            {"(ক) ঢাকা মেডিক্যাল কলেজ",  "(খ) কলকাতা মেডিক্যাল কলেজ",  "(গ) পাটনা মেডিক্যাল কলেজ",  "(ঘ) হুগলি মেডিক্যাল কলেজ"},
            {" (ক) সাংবাদিক",  "(খ) ম্যাজিস্ট্রেট",  "(গ) মেডিক্যাল অফিসার",  "(ঘ) জেলা প্রশাসক"},
            {"(ক) ১৯০৮ সালে",  "(খ) ১৯১৮ সালে",  "(গ) ১৯২০ সালে",  "(ঘ) ১৯২৮ সালে"},
            {"(ক) সবুজপত্র",  "(খ) শনিবারের চিঠি",  "(গ) যুগবাণী",  "(ঘ) আষাঢ়ে গপ্পো"},
            {"(ক) গল্প ও অনুকবিতা",  " (খ) নাটক ও উপন্যাস",  "(গ) গল্প ও ব্যঙ্গ-কবিতা",  "(ঘ) ব্যঙ্গ-কবিতা ও প্যারডি"},
            {" (ক) বনফুলের গল্প",  "(খ) কল্পনা",  "(গ) কুহেলিকা",  "(ঘ) পঞ্চাশৎ"},
            {"(ক) দামিনী",  "(খ) বাহুল্য ",  "(গ) শ্রীকান্ত",  "(ঘ) মৌরীফুল"},
            {"(ক) রবিঠাকুর",  " (খ) ভারতচন্দ্র",  "(গ) বিদ্রোহী নজরুল",  "(ঘ) শ্রীমধুসূদন "},
            {"(ক) ভারতরত্ন",  "(খ) পদ্মভূষণ",  "(গ) বনফুল",  " (ঘ) নাইট"},
            {" (ক) ১৯৪৯ সালে",  "(খ) ১৯৫৯ সালে",  " (গ) ১৯৬৯ সালে",  "(ঘ) ১৯৭৯ সালে"},
            {"(ক) ঢাকা",  "(খ) কলকাতা",  "(গ) মিউনি",  " (ঘ) সিডনি"},
            {"(ক) নিমের ডাল",  "(খ) নিমের পাতা",  "(গ) নিমের ছাল",  "(ঘ) নিমের শেকড়"},
            {"(ক) ছাল",  "(খ) পাতা",  "(গ) ডাল",  " (ঘ) ফল"},
            {"(ক) ডাল",  "(খ) পাতা ",  "(গ) শেকড়",  " (ঘ) ছাল"},
            {"(ক) পেটের পীড়ার",  "(খ) মাথা ব্যথার",  "(গ) চর্মরোগের",  "(ঘ) কোষ্ঠকাঠিন্যের"},
            {"(ক) ডাল",  "(খ) ফল",  "(গ) পাতা ",  "(ঘ) ছাল"},
            {"(ক) পানির সাথে",  "(খ) বেগুনের সাথে",  "(গ) রুটির সাথে",  "(ঘ) ভাতের সাথে"},
            {"(ক) নিমের ডাল",  "(খ) নিমের ছাল",  "(গ) নিমের ফল",  "(ঘ) নিমের পাতা "},
            {"(ক) কচি ডাল",  "(খ) বয়স্ক পাতা",  " (গ) ছাল",  " (ঘ) শেকড়"},
            {" (ক) যকৃত ভালো থাকে",  " (খ) চোখ ভালো থাকে",  " (গ) দাঁত ভালো থাকে",  " (ঘ) মাথাব্যথা ভালো হয়"}


    };






    public static String myCorrectAnswer[] = {

            "(গ) বনফুল",
            "(গ) ১৮৯৯ সালে ",
            "(খ) বিহারের পূর্ণিয়া ",
            "(ঘ) মণিহার ",
            "(গ) সত্যনারায়ণ মুখোপাধ্যায়",
            " (ক) সাহেবগঞ্জ ইংরেজি উচ্চ বিদ্যালয়",
            "(খ) ১৯১৮ ",
            "(গ) ১৯২০",
            "(ঘ) ১৯২৭ ",
            "(ঘ) সেন্ট কলম্বাস কলেজ ",
            "(গ) পাটনা মেডিক্যাল কলেজ",
            "(গ) মেডিক্যাল অফিসার",
            "(খ) ১৯১৮ সালে",
            "(খ) শনিবারের চিঠি",
            "(ঘ) ব্যঙ্গ-কবিতা ও প্যারডি",
            " (ক) বনফুলের গল্প",
            "(খ) বাহুল্য ",
            "(ঘ) শ্রীমধুসূদন ",
            "(খ) পদ্মভূষণ",
            "(ঘ) ১৯৭৯ সালে",
            "(খ) কলকাতা",
            "(গ) নিমের ছাল",
            "(খ) পাতা",
            "(খ) পাতা ",
            "(গ) চর্মরোগের",
            "(গ) পাতা ",
            "(খ) বেগুনের সাথে",
            "(ঘ) নিমের পাতা ",
            "(ক) কচি ডাল",
            " (খ) চোখ ভালো থাকে"


    };



}
