package com.soft.mcqbanglabook;

public class PolliJononiQNA {


    public static String myQuestion[] ={
            "১. ‘পল্লিজননী’ কবিতাটির রচয়িতা কে?",
            "২. কবি জসীমউদ্দীন কত সালে জন্মগ্রহণ করেন? ",
            "৩. কবি জসীমউদ্দীন কোন জেলার জন্মগ্রহণ করেন?",
            "৪. কবি জসীমউদ্দীনের কবিতায় কোন বিষয়টি বেশি প্রকাশিত হয়েছে?",
            "৫. কবি জসীমউদ্দীনের উপাধি কী?",
            "৬. কবি জসীমউদ্দীন কর্মজীবনের শুরুতে কোথায় অধ্যাপনা করেন?",
            "৭. কবি জসীমউদ্দীনের কাব্য প্রতিভার বিকাশ ঘটে কখন?",
            "৮. কবি জসীমউদ্দীনের কোন কবিতাটি তিনি বিশ্ববিদ্যালয়ে অধ্যয়নকালেই প্রবেশিকা বাংলা সংকলনের অন্তর্ভুক্ত হয়?",
            "৯. কবি জসীমউদ্দীনের কোন কাব্যগ্রন্থ বিভিন্ন বিদেশি ভাষায় অনূদিত হয়েছে?",
            "১০. কোনটি কবি জসীমউদ্দীনের রচিত ভ্রমণকাহিনী?",
            "১১. কবি জসীমউদ্দীনকে সম্মানসূচক ডি.লিট ডিগ্রি প্রদান করে কোন প্রতিষ্ঠান?",
            "১২. কবি জসীমউদ্দীন কত সালে মৃত্যুবরণ করেন?",
            "১৩. পল্লিজননী অন্ধকার রাতে জেগে রয়েছেন কেন? ",
            "১৪. পল্লিজননী কোথায় বসে রয়েছেন?",
            "১৫. ‘পল্লিজননী’ কবিতায় কোথায় নিবু নিবু দীপ ঘুরে ঘুরে জ্বলছে?",
            "১৬. ‘পল্লিজননী’ কবিতায় এদো ডোবা থেকে কিসের দুর্গন্ধ ছড়াচ্ছে?",
            "১৭. পল্লিজননীর ঘর কেমন?",
            "১৮. পল্লিজননীর ঘরের বেড়ার ফাঁক দিয়ে কী আসে?",
            "১৯. ‘পল্লিজননী’ কবিতায় মা ছেলের শিয়রে বসে কী করছেন?",
            "২০. ‘পল্লিজননী’ কবিতায় ছেলেটির শুয়ে থাকতে ভালো লাগে না কেন?",
            "২১. পল্লিজননী ছেলের পাণ্ডুর গালে চুমো খায় কেন?",
            "২২. পল্লিজননী ছেলের সুস্থতার জন্য কোথায় মোমবাতি মানে? ",
            "২৩. পল্লিজননীর প্রাণ কাঁদে কেন? ",
            "২৪. ‘পল্লিজননী’ কবিতায় কোথায় কানা কুয়ো ডাকে?",
            "২৫. ‘পল্লিজননী’ কবিতায় কিসের বাতাসে সুপারির বন হেলে পড়ে?",
            "২৬. ‘পল্লিজননী’ কবিতায় বুনো পথে কুয়াশার কাফন ধরে কে যায়?",
            "২৭. পল্লিজননীর মনে কিসের শঙ্কা জাগে?",
            "২৮. কোন কথা ভাবতে পল্লিজননীর প্রাণ শিউরে ওঠে?",
            "২৯. পল্লিজননী মনে মনে কিসের জাল বোনে?",
            "৩০. ‘পল্লিজননী’ কবিতায় রুগ্ণ ছেলেটি কার ঝাড়ফুঁকের কথা বলেছে?"



    };   public static String myChoices[][] = {

            {"[ক] কাজী নজরুল ইসলাম",  "[খ] ফররুখ আহমদ",  "[গ] জসীমউদ্দীন",  "[ঘ] সুকান্ত ভট্টাচার্য"},
            {"[ক] ১৯০১ সালে",  "[খ] ১৯০২ সালে",  "[গ] ১৯০৩ সালে",  "[ঘ] ১৯০৪ সালে"},
            {"[ক] বরিশাল",  "[খ] নরসিংদী",  "[গ] ফরিদপুর",  "[ঘ] পাবনা"},
            {"[ক] পল্লির মাটি ও মানুষের জীবনচিত্র",  "[খ] বাংলার সামাজিক বৈষম্যের দিক",  "[গ] পিছিয়ে পড়া জনগোষ্ঠীর জীবনচিত্র",  "[ঘ] সরকারের অবিচারের প্রতিবাদ"},
            {"[ক] সাম্যের কবি",  "[খ] বিদ্রোহী কবি",  "[গ] স্বভাবকবি",  "[ঘ] পল্লিকবি"},
            {"[ক] কলকাতা বিশ্ববিদ্যালয়ে",  "[খ] আলীগড় বিশ্ববিদ্যালয়ে",  "[গ] জাহাঙ্গীরনগর বিশ্ববিদ্যালয়ে",  "[ঘ] ঢাকা বিশ্ববিদ্যালয়ে"},
            {"[ক] শিশু অবস্থায়",  "[খ] ছাত্র অবস্থায়",  "[গ] অধ্যাপনা শুরুর পর",  "[ঘ] শেষ বয়সে"},
            {"[ক] পল্লিজননী",  "[খ] বালুচর",  "[গ] আসমানী",  "[ঘ] কবর"},
            {"[ক] নকশী কাঁথার মাঠ",  "[খ] রাখালী",  "[গ] বালুচর",  "[ঘ] এক পয়সার বাঁশি"},
            {"[ক] নকশী কাঁথার মাঠ",  "[খ] রাখালী",  "[গ] চলে মুসাফির",  "[ঘ] হাসু"},
            {"[ক] ঢাকা বিশ্ববিদ্যালয়",  "[খ] কলকাতা বিশ্ববিদ্যালয়",  "[গ] আলীগড় বিশ্ববিদ্যালয়",  "[ঘ] বিশ্বভারতী বিশ্ববিদ্যালয়"},
            {"[ক] ১৯৭৩ সালে",  "[খ] ১৯৭৪ সালে",  "[গ] ১৯৭৫ সালে",  "[ঘ] ১৯৭৬ সালে"},
            {"[ক] ছেলের অসুস্থতার কারণে",  "[খ] কাজ করার জন্য",  "[গ] প্রার্থনা করার জন্য",  "[ঘ] কবিরাজের অপেক্ষায়"},
            {"[ক] বারান্দায়",  "[খ] দাওয়ায়",  "[গ] রুগ্ণ ছেলের শিয়রে",  "[ঘ] রুগ্ণ ছেলের পায়ের কাছে"},
            {"[ক] রুগ্ণ ছেলের শিয়রে",  "[খ] ঘরের চৌকাঠের কাছে",  "[গ] চেয়ারের ওপর",  "[ঘ] রুগ্ণ ছেলের পায়ের কাছে"},
            {"[ক] পচা কাদার",  "[খ] পচান পাতার",  "[গ] পচা পাটের",  "[ঘ] পচা মাছের"},
            {"[ক] পাকা",  "[খ] টিনের তৈরি",  "[গ] আধাপাকা",  "[ঘ] কুঁড়েঘর"},
            {"[ক] নেড়ী কুকুর",  "[খ] বিড়াল",  "[গ] শীতের বাতাস",  "[ঘ] রোদের কিরণ"},
            {"[ক] পাটি তৈরি করছেন",  "[খ] মাথায় জলপট্টি দিচ্ছেন",  "[গ] ছেলের নানা ঘটনা ভাবছেন",  "[ঘ] হস্তশিল্পের "},
            {"[ক] অসুস্থতার কারণে",  "[খ] মায়ের বকুনির কারণে",  "গ] খেলতে যাবে বলে",  "[ঘ] পচান পাতার দুর্গন্ধে"},
            {"[ক] খুশি হয়ে",  "খ] মমতায়",  "[গ] ছেলে শুয়ে থাকতে না চাওয়ায়",  "ঘ] ছেলে সুস্থ হয়ে যাওয়ায়"},
            {"[ক] মাজারে",  "[খ] দরগায়",  "[গ] মসজিদে",  "[ঘ] মন্দিরে"},
            {"[ক] অভাবের কারণে",  "[খ] সন্তানের অসুস্থতার জন্য",  "[গ] ছেলের শীত লাগায়",  "[ঘ] পুতুল কেনার"},
            {"[ক] ঘরের চালে",  "[খ] সুপারিগাছে",  "[গ] বাঁশবনে",  "[ঘ] শালবনে"},
            {"[ক] ঝড়ের বাতাসে",  "[খ] শীতের ঠাণ্ডা হাওয়ায়",  "[গ] হুতোমের পাখার বাতাসে",  "[ঘ] বাদুড়ের পাখায় বাতাসে"},
            {"[ক] বাদুড়ের দল",  "[খ] হুতোমের দল",  "[গ] কানাকুয়ো",  "[ঘ] জোনাকি মেয়েরা"},
            {"[ক] দীপ নিভে যাওয়ার",  "[খ] সন্তান হারানোর",  "[গ] সুপারির বন হেলে পড়ার",  "[ঘ] ছেলের লাটাই হারিয়ে ফেলার"},
            {"[ক] হুতোমের ডাকের কথা",  "[খ] অন্ধকার রাতের কথা",  "[গ] কানাকুয়োর কথা",  "[ঘ] ছেলে হারানোর কথা"},
            {"[ক] অভাব দূর করার",  "[খ] ছেলের বায়না পূরণের",  "[গ] ছেলের সুস্থতার",  "[ঘ] ছেলের লাটাই যত্নে রাখার"},
            {"[ক] করিমের",  "[খ] আজিজের",  "[গ] রহিম চাচার",  "[ঘ] জালাল কবিরাজের"}


    };
    public static String myCorrectAnswer[] = {

            "[গ] জসীমউদ্দীন",
            "[গ] ১৯০৩ সালে",
            "[গ] ফরিদপুর",
            "[ক] পল্লির মাটি ও মানুষের জীবনচিত্র",
            "[ঘ] পল্লিকবি",
            "[ঘ] ঢাকা বিশ্ববিদ্যালয়ে",
            "[খ] ছাত্র অবস্থায়",
            "[ঘ] কবর",
            "[ক] নকশী কাঁথার মাঠ",
            "[গ] চলে মুসাফির",
            "[ঘ] বিশ্বভারতী বিশ্ববিদ্যালয়",
            "[ঘ] ১৯৭৬ সালে",
            "[ক] ছেলের অসুস্থতার কারণে",
            "[গ] রুগ্ণ ছেলের শিয়রে",
            "[ক] রুগ্ণ ছেলের শিয়রে",
            "[খ] পচান পাতার",
            "[ঘ] কুঁড়েঘর",
            "[গ] শীতের বাতাস",
            "[গ] ছেলের নানা ঘটনা ভাবছেন",
            "[ক] অসুস্থতার কারণে",
            "খ] মমতায়",
            "[গ] মসজিদে",
            "[খ] সন্তানের অসুস্থতার জন্য",
            "[গ] বাঁশবনে",
            "[ঘ] বাদুড়ের পাখায় বাতাসে",
            "[ঘ] জোনাকি মেয়েরা",
            "[খ] সন্তান হারানোর",
            "[ঘ] ছেলে হারানোর কথা",
            "[গ] ছেলের সুস্থতার",
            "[গ] রহিম চাচার"


    };



}
