package com.soft.mcqbanglabook;

public class Probas_BondhuQNA {


    public static String myQuestion[] ={
            "১. ‘বই পড়া’ প্রবন্ধ অনুসারে ডেমোক্রেসির উত্তরাধিকারী কারা?",
            "২. ‘জ্ঞানের সৃষ্টি মনসাপেক্ষ’। এখানে ‘মনসাপেক্ষ’ অর্থ কী?",
            "৩. প্রমথ চৌধুরীর মতে, দর্শনের চর্চা কোথায় করা যায়?",
            "৪. ‘বই পড়া’ প্রবন্ধে লেখক লাইব্রেরিকে হাসপাতালের ওপরে স্থান দিয়েছেন কেন?",
            "৫.‘বই পড়া’ রচনায় লেখক শিক্ষকদের কী হতে বলেছেন?",
            "৬. শিক্ষকের সার্থকতা কোথায়?",
            "৭. বিদ্যার সাধনায় গুরুকে ‘উত্তরসাধক’ বলা হয়েছে কেন?",
            "৮. শিষ্যকে বিদ্যার সাধনা কীভাবে করতে হয়?",
            "৯. ‘দেহের মৃত্যুর রেজিস্টারি রাখা হয়, আত্মার হয় না’—প্রমথ চৌধুরীর এ মন্তব্যে কী প্রকাশ পেয়েছে?",
            "১০. ‘শিক্ষার অপ্রয়োজনের দিকই শ্রেষ্ঠ দিক’ বলতে আসলে কোনটিকে বোঝানো হয়েছে?",



    };


    public static String myChoices[][] = {

            {"ক. ইংরেজরা",  "খ. বাঙালিরা ",  "গ. ভারতীয়রা",  "ঘ. পাকিস্তানিরা"},
            {"ক. মনোবাঞ্ছিত",  "খ. মনোনিবিষ্ট ",  "গ. মননির্ভরশীল ",  "ঘ. মনোগ্রাহ্য"},
            {"ক. ঘরে",  "খ. জাদুঘরে ",  "গ. লাইব্রেরিতে",  "ঘ. গুহায়"},
            {"ক. মানসিক সুস্থতার জন্য",  "খ. শারীরিক সুস্থতার জন্য",  "গ. উচ্চশিক্ষা অর্জনের জন্য",  "ঘ. জ্ঞানে বড় হওয়ার জন্য"},
            {"ক. দাতা",  "খ. গ্রহীতা",  "গ. চালক ",  "ঘ. সহায়ক"},
            {"ক. আত্মনিবেদিত হয়ে শিক্ষাদানে",  "খ. শিক্ষা অর্জনে ছাত্রকে সক্ষম করায়",  "গ. শিক্ষার্থীকে জ্ঞানদান করায় ",  "ঘ. শিক্ষার্থীকে অধিক নম্বর অর্জনে সক্ষম করায়"},
            {"ক. শিষ্যকে বিদ্যা শেখান বলে ",  "খ. শিষ্যকে শিখতে উদ্বুদ্ধ করেন বলে",  "গ. শিষ্যকে মানুষ করে তোলেন বলে ",  "ঘ. শিষ্যকে পড়া মুখস্থের তাগিদ দেন বলে"},
            {"ক. নিজ চেষ্টায়",  "খ. বই পড়ে",  "গ. গুরুকে অনুসরণ করে ",  "ঘ. আত্মস্থ করে"},
            {"ক. জাতীয় দৃষ্টিভঙ্গির সংকীর্ণতা",  "খ. স্বাস্থ্যসেবার খণ্ডিত রূপ",  "গ. মানসিক স্বাস্থে্৵র প্রতি উদাসীনতা",  "ঘ. শিক্ষাপদ্ধতির সীমাবদ্ধতা"},
            {"ক. শিক্ষার্জনের মাধ্যমেই জীবসত্তাকে টিকিয়ে রাখা",  "খ. শিক্ষা লাভ করার মাধ্যমে মনুষ্যত্ব জাগ্রত করা",  "গ. শিক্ষালাভের মাধ্যমেই জীবনকে সাজানো",  "ঘ. শিক্ষার্জন মানেই বুদ্ধিমান মানুষ তৈরি হওয়া"},


    };


    public static String myCorrectAnswer[] = {


            "ক. ইংরেজরা",
            "গ. মননির্ভরশীল ",
            "ঘ. গুহায়",
            "ক. মানসিক সুস্থতার জন্য",
            "ঘ. সহায়ক",
            "খ. শিক্ষা অর্জনে ছাত্রকে সক্ষম করায়",
            "খ. শিষ্যকে শিখতে উদ্বুদ্ধ করেন বলে",
            "ক. নিজ চেষ্টায়",
            "ক. জাতীয় দৃষ্টিভঙ্গির সংকীর্ণতা",
            "খ. শিক্ষা লাভ করার মাধ্যমে মনুষ্যত্ব জাগ্রত করা",


    };

}
