package com.soft.mcqbanglabook;

public class ProtupokarQNA {



    public static String myQuestion[] ={
            "১. ‘বই পড়া’ প্রবন্ধ অনুসারে ডেমোক্রেসির উত্তরাধিকারী কারা?",
            "২. ‘জ্ঞানের সৃষ্টি মনসাপেক্ষ’। এখানে ‘মনসাপেক্ষ’ অর্থ কী?",
            "৩. প্রমথ চৌধুরীর মতে, দর্শনের চর্চা কোথায় করা যায়?",



    };


    public static String myChoices[][] = {

            {"ক. ইংরেজরা",  "খ. বাঙালিরা ",  "গ. ভারতীয়রা",  "ঘ. পাকিস্তানিরা"},
            {"ক. মনোবাঞ্ছিত",  "খ. মনোনিবিষ্ট ",  "গ. মননির্ভরশীল ",  "ঘ. মনোগ্রাহ্য"},
            {"ক. ঘরে",  "খ. জাদুঘরে ",  "গ. লাইব্রেরিতে",  "ঘ. গুহায়"},


    };


    public static String myCorrectAnswer[] = {


            "ক. ইংরেজরা",
            "গ. মননির্ভরশীল ",
            "ঘ. গুহায়",


    };



}
