package com.soft.mcqbanglabook;

public class Sahittor_RupQNA {



    public static String myQuestion[] ={
            "১. ‘সাহিত্যের রূপ ও রীতি’ প্রবন্ধের লেখক কে?",
            "২. হায়াৎ মামুদ কত খ্রিষ্টাব্দে জন্মগ্রহণ করেন?",
            "৩. হায়াৎ মামুদের জন্ম তারিখ কোনটি?",
            "৪. পশ্চিমবঙ্গের হুগলি জেলার মৌড়া গ্রামে কে জন্মগ্রহণ করেন?",
            "৫. হায়াৎ মামুদ বর্তমানে কোথাকার বাসিন্দা?",
            "৬. হায়াৎ মামুদের পিতার নাম কী?",
            "৭. হায়াৎ মামুদের মায়ের নাম কী?",
            "৮. হায়াৎ মামুদ প্রবেশিকা পরীক্ষা পাস করেন কত সালে?",
            "৯. হায়াৎ মামুদ ঢাকার কোন স্কুল থেকে প্রবেশিকা পরীক্ষায় উত্তীর্ণ হন?",
            "১০. হায়াৎ মামুদ কত সালে উচ্চ মাধ্যমিক পাস করেন?",
            "১১. হায়াৎ মামুদ কোন কলেজ থেকে উচ্চ মাধ্যমিক পাস করেন?",
            "১২. হায়াৎ মামুদ কোন বিশ্ববিদ্যালয় থেকে স্নাতক ও স্নাতকোত্তর ডিগ্রি লাভ করেন?",
            "১৩. হায়াৎ মামুদ কোন বিষয়ে স্নাতক ও স্নাতকোত্তর ডিগ্রি লাভ করেন?",
            "১৪. হায়াৎ মামুদ কোন বিশ্ববিদ্যালয় থেকে পিএইচডি ডিগ্রি অর্জন করেন?",
            "১৫. কায়েদে আজম কলেজের বর্তমান নাম কী?",
            "১৬. হায়াৎ মামুদ কোন বিশ্ববিদ্যালয়ে অধ্যাপনা করেন?",
            "১৭. হায়াৎ মামুদ কোন বিষয়ে খ্যাতি লাভ করেন?",
            "১৮. হায়াৎ মামুদ কত সংখ্যক গ্রন্থের রচয়িতা?",
            "১৯. ‘স্বগত সংলাপ’ কার লেখা গ্রন্থ?",
            "২০. সাহিত্যে অবদানের জন্য হায়াৎ মামুদ কোন পুরস্কার পান?",
            "২১. ‘কিশোর বাংলা অভিধান’-এর রচয়িতা কে?",
            "২২. হায়াৎ মামুদের পেশা কী ছিল?",
            "২৩. রবীন্দ্রনাথ ও নজরুলের কিশোর জীবনী কে লেখেন?",
            "২৪. হায়াৎ মামুদের লেখা গ্রন্থ কোনটি?",
            "২৫. হায়াৎ মামুদ কোনটিকে বিশাল পরিধির বলেছেন?",
            "২৬. সাহিত্যের রূপ কী?",
            "২৭. সাহিত্যের বিভিন্ন শাখার গঠন নিয়ে পর্যবেক্ষণ ও আলোচনাকে কী বলে?",
            "২৮. ‘মেঘনাদবধ’ কাব্যের রচয়িতা কে?",
            "২৯. মহাকাব্যের চূড়ান্ত সফল রূপ কোন কাব্যে প্রকাশিত?",
            "৩০. মহাকাব্য রচিত হয় কোন ধরনের কাহিনী অবলম্বনে?"



    };


    public static String myChoices[][] = {

            {"ক. প্রমথ চৌধুরী",  "খ. হায়াৎ মামুদ",  "গ. শওকত ওসমান",  "ঘ. হুমায়ুন আজাদ"},
            {"ক. ১৯৩৯",  "খ. ১৯৪৯",  "গ. ১৯৩৫",  "ঘ. ১৯৪০"},
            {"ক. ৫ই মে",  "খ. ২৫ শে মে",  "গ. ২রা জুলাই",  "ঘ. ৬ই জুলাই"},
            {"ক. বনফুল",  "খ. ফররুখ আহমদ",  "গ. হায়াৎ মামুদ",  "ঘ. কাজী নজরুল ইসলাম"},
            {"ক. ঢাকার মিরপুর",  "খ. ঢাকার গেণ্ডারিয়া",  "গ. ঢাকার মালিবাগ",  "ঘ. ঢাকার আজিমপুর"},
            {"ক. মুহম্মদ শমসের আলী",  "খ. জাফর ইমাম",  "গ. আলী আজগর খান",  "ঘ. বেলায়েত হোসেন"},
            {"ক. জাকিয়া সুলতানা",  "খ. আমিনা খাতুন",  "গ. আফরোজা আক্তার",  "ঘ. সোনিয়া ইয়াসমিন"},
            {"ক. ১৯৫০",  "খ. ১৯৫২",  "গ. ১৯৫৬",  "ঘ. ১৯৬০"},
            {"ক. সেন্ট গ্রেগরিজ",  "খ. শামসুল হক উচ্চ বিদ্যালয়",  "গ. উদয়ন স্কুল অ্যান্ড কলেজ",  " ঘ. রেসিডেন্সিয়াল মডেল কলেজ"},
            {"ক. ১৯৫৮",  "খ. ১৯৬০",  "গ. ১৯৬২",  "ঘ. ১৯৬৪"},
            {"ক. ঢাকা কলেজ",  "খ. নটরডেম কলেজ",  "গ. কায়েদে আজম কলেজ",  "ঘ. কবি নজরুল কলেজ"},
            {"ক. চট্টগ্রাম বিশ্ববিদ্যালয়",  "খ. ঢাকা বিশ্ববিদ্যালয়",  "গ. রাজশাহী বিশ্ববিদ্যালয়",  " ঘ. খুলনা বিশ্ববিদ্যালয়"},
            {"ক. ইংরেজি",  "খ. ইতিহাস",  "গ. বাংলা",  "ঘ. নাট্যতত্ত্ব"},
            {"ক. ঢাকা বিশ্ববিদ্যালয়",  "খ. যাদবপুর বিশ্ববিদ্যালয়",  "গ. চট্টগ্রাম বিশ্ববিদ্যালয়",  "ঘ. জাহাঙ্গীরনগর বিশ্ববিদ্যালয়"},
            {"ক. ঢাকা কলেজ",  "খ. সরকারি হোসেন শহীদ সোহরাওয়ার্দী কলেজ",  "গ. জগন্নাথ কলেজ",  "ঘ. মিরপুর বাংলা কলেজ"},
            {"ক. চট্টগ্রাম ও জাহাঙ্গীরনগর বিশ্ববিদ্যালয়",  "খ. ঢাকা ও রাজশাহী বিশ্ববিদ্যালয়",  "গ. রাজশাহী ও জগন্নাথ বিশ্ববিদ্যালয়",  "ঘ. ঢাকা ও খুলনা বিশ্ববিদ্যালয়"},
            {"ক. কবিতা",  "খ. উপন্যাস",  "গ. গবেষণা ও প্রবন্ধ",  "ঘ. নাটক"},
            {"ক. দুই শতাধিক",  "খ. অর্ধশতাধিক",  "গ. শতাধিক",  "ঘ. দেড় শতাধিক"},
            {"ক. হুমায়ূন আহমেদ",  "খ. শামসুর রাহমান",  "গ. হায়াৎ মামুদ",  "ঘ. আল মাহমুদ"},
            {"ক. বাংলা একাডেমি পুরস্কার",  "খ. একুশে পদক",  "গ. আলাওল সাহিত্য পুরস্কার",  "ঘ. স্বাধীনতা পদক"},
            {" ক. ড. মুহম্মদ শহীদুল্লাহ",  "খ. ড. আনিসুজ্জামান",  "গ. নরেন বিশ্বাস",  "ঘ. হায়াৎ মামুদ"},
            {" ক. অধ্যাপনা",  "খ. সাংবাদিকতা",  " গ. গবেষণা",  " ঘ. শিল্পকর্ম"},
            {"ক. নির্মলেন্দু গুণ",  "খ. আহমদ শরীফ",  "গ. হায়াৎ মামুদ",  "ঘ. হুমায়ুন আজাদ"},
            {"ক. নিবিড় নীলিমা",  "খ. বাংলা লেখার নিয়মকানুন",  "গ. শ্যামল ছায়া",  "ঘ. বৃষ্টির ঠিকানা"},
            {"ক. উপন্যাস",  "খ. গল্প",  "গ. নাটক",  "ঘ. সাহিত্য"},
            {" ক. সাহিত্যের বিভিন্ন শাখা",  "খ. উপমা",  "গ. উৎপ্রেক্ষা",  " ঘ. চিত্রকল্প"},
            {"ক. রীতি",  "খ. সাহিত্য বিচার",  "গ. গবেষণা",  "ঘ. সমালোচনা"},
            {"ক. মীর মশাররফ হোসেন",  "খ. সত্যেন্দ্রনাথ দত্ত",  " গ. সুকুমার রায়",  "ঘ. মাইকেল মধুসূদন দত্ত"},
            {" ক. মেঘনাদবধ কাব্য",  "খ. বীরাঙ্গনা কাব্য",  " গ. ব্রজাঙ্গনা কাব্য",  "ঘ. তিলোত্তমাসম্ভব কাব্য"},
            {" ক. রাজাদের কাহিনি",  "খ. যুদ্ধবিগ্রহের কাহিনি",  "গ. প্রেমের কাহিনি",  "ঘ. অসহায় মানুষের কাহিনি"}


    };





    public static String myCorrectAnswer[] = {

            "খ. হায়াৎ মামুদ",
            "ক. ১৯৩৯",
            "গ. ২রা জুলাই",
            "গ. হায়াৎ মামুদ",
            "খ. ঢাকার গেণ্ডারিয়া",
            "ক. মুহম্মদ শমসের আলী",
            "খ. আমিনা খাতুন",
            "গ. ১৯৫৬",
            "ক. সেন্ট গ্রেগরিজ",
            "ক. ১৯৫৮",
            "গ. কায়েদে আজম কলেজ",
            "খ. ঢাকা বিশ্ববিদ্যালয়",
            "গ. বাংলা",
            "খ. যাদবপুর বিশ্ববিদ্যালয়",
            "খ. সরকারি হোসেন শহীদ সোহরাওয়ার্দী কলেজ",
            "ক. চট্টগ্রাম ও জাহাঙ্গীরনগর বিশ্ববিদ্যালয়",
            "গ. গবেষণা ও প্রবন্ধ",
            "খ. অর্ধশতাধিক",
            "গ. হায়াৎ মামুদ",
            "ক. বাংলা একাডেমি পুরস্কার",
            "ঘ. হায়াৎ মামুদ",
            " ক. অধ্যাপনা",
            "গ. হায়াৎ মামুদ",
            "খ. বাংলা লেখার নিয়মকানুন",
            "ঘ. সাহিত্য",
            " ক. সাহিত্যের বিভিন্ন শাখা",
            "ক. রীতি",
            "ঘ. মাইকেল মধুসূদন দত্ত",
            " ক. মেঘনাদবধ কাব্য",
            "খ. যুদ্ধবিগ্রহের কাহিনি"



    };







}
