package com.soft.mcqbanglabook;

public class SeidinaiMatQNA {




    public static String myQuestion[] ={
            "১. ‘সেইদিন এই মাঠ’ কবিতার কবি কে?",
            "২. জীবনানন্দ দাশের জন্ম কত সালে?",
            "৩. জীবনানন্দ দাশের জন্মস্থান কোনটি?",
            "৪. জীবনানন্দ দাশের বাবার নাম কী?",
            "৫. জীবনানন্দ দাশের মায়ের নাম কী?",
            "৬. জীবনানন্দ দাশের মা কোনটি ছিলেন?",
            "৭. জীবনানন্দ দাশ নিচের কোন স্কুলে শিক্ষালাভ করেন? ",
            "৮. জীবনানন্দ দাশ কোন কলেজ থেকে শিক্ষালাভ করেন?",
            "৯. জীবনানন্দ দাশ কলকাতার কোন কলেজে পড়াশোনা করেন?",
            "১০. জীবনানন্দ দাশ কত সালে এম.এ ডিগ্রি লাভ করেন?",
            "১১. জীবনানন্দ দাশ কোন বিশ্ববিদ্যালয় থেকে এম.এ ডিগ্রি লাভ করেন?",
            "১২. জীবনানন্দ দাশ কোন বিষয়ে এম.এ ডিগ্রি লাভ করেন?",
            "১৩. এম.এ ডিগ্রি লাভের পর জীবনানন্দ দাশ কোন পেশায় নিয়োজিত ছিলেন?",
            "১৪. জীবনানন্দ দাশ প্রধানত কী হিসেবে পরিচিত?",
            "১৫. কবি জীবনানন্দ দাশ কিসে নিমগ্নচিত্ত ছিলেন? ",
            "১৬. কবি জীবনানন্দ দাশের দৃষ্টিতে কোনটি অনন্য রূপসী?",
            "১৭. কোনটি জীবনানন্দ দাশ রচিত উল্লেখযোগ্য গ্রন্থ?",
            "১৮. কোনটি জীবনানন্দ দাশ রচিত কাব্যগ্রন্থ?",
            "১৯. জীবনানন্দ দাশ কী দুর্ঘটনায় পতিত হয়ে মৃত্যুবরণ করেন?",
            "২০. জীবনানন্দ দাশ কত সালে ট্রাম দুর্ঘটনায় পতিত হন?",
            "২১. জীবনানন্দ দাশ কোন তারিখে মৃত্যুবরণ করেন?",
            "২২. কোনটি স্তব্ধ হবে না বলে কবির জানা আছে?",
            "২৩. ‘সেইদিন এই মাঠ’ কবিতায় নক্ষত্রের তলে কোনটির স্বপ্ন দেখার কথা বলা হয়েছে?",
            "২৪. জীবনানন্দ দাশের মতে কখনোই কোনটি ঝরে পড়ে না? ",
            "২৫. ‘সেইদিন এই মাঠ’ কবিতায় শিশিরের জলে কোনটি ভেজার কথা উল্লেখ রয়েছে?",
            "২৬. লক্ষীপেঁচা কার তরে গান করবে?",
            "২৭. ‘সেইদিন এই মাঠ’ কবিতায় কেমন বাতির কথা বলা হয়েছে?",
            "২৮. খেয়ানৌকাগুলো কোথায় এসে লেগেছে?",
            "২৯. ‘সেইদিন এই মাঠ স্তব্ধ হবে নাকো জানি’- এখানে কোন ভাবটি প্রকাশিত হয়েছে?",
            "৩০. ‘বেবিলন ছাই হয়ে আছে’- কথাটির মাধ্যমে কী বোঝানো হয়েছে? "



    };

    public static String myChoices[][] = {

            {"[ক] সত্যেন্দ্রনাথ দত্ত",  "[খ] জসীমউদ্দীন",  "[গ] জীবনানন্দ দাশ",  "[ঘ] ফররুখ আহমদ"},
            {"[ক] ১৮৮০ সালে",  "[খ] ১৮৮৯ সালে",  "[গ] ১৮৯০ সালে",  "[ঘ] ১৮৯৯ সালে"},
            {"[ক] কলকাতা",  "[খ] খুলনা",  "[গ] বরিশাল",  "[ঘ] মালদহ"},
            {"[ক] আনন্দ দাশ",  "[খ] সত্যানন্দ দাশ",  "[গ] বিবেকানন্দ দাশ",  "[ঘ] জ্ঞানানন্দ দাশ"},
            {"[ক] কামিনী দাশ",  "[খ] কুসুমকুমারী দাশ",  "[গ] বঙ্কাবতী দাশ",  "[ঘ] কিরণমালা দাশ"},
            {"[ক] অভিনেত্রী",  "[খ] ঔপন্যাসিকা",  "[গ] স্বভাব কবি",  "[ঘ] সংগীতশিল্পী"},
            {"[ক] গোদানাইল হাইস্কুল",  "[খ] ব্রজমোহন স্কুল",  "[গ] দরিরামপুর হাইস্কুল",  "[ঘ] ঢাকা কলেজিয়েট স্কুল"},
            {"[ক] ব্রজমোহন কলেজ",  "[খ] জগন্নাথ কলেজ",  "[গ] হিন্দু কলেজ",  "[ঘ] রিপন কলেজ"},
            {"[ক] রিপন কলেজ",  "[খ] ফোর্ট উইলিয়াম কলেজ",  "[গ] প্রেসিডেন্সি কলেজ",  "[ঘ] হিন্দু কলেজ"},
            {"[ক] ১৯১৮ সালে",  "[খ] ১৯১৯ সালে",  "[গ] ১৯২০ সালে",  "[ঘ] ১৯২১ সালে"},
            {"[ক] ঢাকা বিশ্ববিদ্যালয়",  "[খ] চট্টগ্রাম বিশ্ববিদ্যালয়",  "[গ] কলকাতা বিশ্ববিদ্যালয়",  "[ঘ] রবীন্দ্রভারতী বিশ্ববিদ্যালয়"},
            {"[ক] বাংলা",  "[খ] ইংরেজি",  "[গ] দর্শন",  "[ঘ] ভাষাতত্ত"},
            {"[ক] সাংবাদিকতা",  "[খ] অধ্যাপনা",  "[গ] সরকারি চাকরি",  "[ঘ] আইন"},
            {"[ক] প্রাচীন মতাদর্শের কবি",  "[খ] পাশ্চাত্য ভাবধারার কবি",  "[গ] আধুনিক জীবনচেতনার কবি",  "[ঘ] ধর্মীয় ভাবাদর্শের কবি"},
            {"[ক] বাংলার মানুষের জীবনযাত্রা প্রত্যক্ষকরণে",  "[খ] বাংলার প্রকৃতির রূপ প্রত্যক্ষকরণে",  "[গ] নাটক রচনায়",  "[ঘ] মহাকাব্য রচনায়"},
            {"[ক] সমস্ত পৃথিবী",  "[খ] কলকাতার প্রকৃতি",  "[গ] দিগন্তবিস্তৃত মাঠ",  "[ঘ] বাংলার প্রকৃতি"},
            {"[ক] শীত বিকেল",  "[খ] পাখির বাসা",  "[গ] মহাপৃথিবী",  "[ঘ] বাংলার মাটি বাংলার জল"},
            {"[ক] সাতটি তারার তিমির",  "[খ] আনন্দের মৃত্যু",  "[গ] পঞ্চাশ সহস্রবর্ষ",  "[ঘ] ধূলি ও সাগর দৃশ্য"},
            {"[ক] বিমান দুর্ঘটনা",  "[খ] নৌ দুর্ঘটনা",  "[গ] ট্রাম দুর্ঘটনা",  "[ঘ] বাস দুর্ঘটনা"},
            {"[ক] ১৯২১ সালে",  "[খ] ১৯৩৪ সালে",  "[গ] ১৯৫০ সালে",  "[ঘ] ১৯৫৪ সালে"},
            {"[ক] ১৪ই অক্টোবর ১৯৫৪",  "[খ] ১৪ই আগস্ট ১৯৫৪",  "[গ] ২২ শে অক্টোবর ১৯৫৪",  "[ঘ] ২২শে আগস্ট ১৯৫৪"},
            {"[ক] এই মাঠ",  "[খ] এই স্বপ্ন",  "[গ] এই গান",  "[ঘ] এই সাধ"},
            {"[ক] সমুদ্রের",  "[খ] নদীর",  "[গ] মাঠের",  "[ঘ] পাহাড়ের"},
            {"[ক] চালতাফুল",  "[খ] ভিজে গন্ধ",  "[গ] সোনার স্বপ্নের সাধ",  "[ঘ] নক্ষত্রের বাতি"},
            {"[ক] কদমফুল",  "[খ] বকুলফুল",  "[গ] চলতা ফুল",  "[ঘ] ঝিঙেফুল"},
            {"[ক] মানুষের তরে",  "[খ] সঙ্গীনির তরে",  "[গ] বঙ্গজ জনের তরে",  "[ঘ] পল্লিজননীর তরে"},
            {"[ক] শান্ত বাতি",  "[খ] অত্যুজ্জ্বল বাতি",  "[গ] নি®প্রভ বাতি",  "[ঘ] অসহ্য বাতি"},
            {"[ক] ঘাটের কাছে",  "[খ] চরের কাছে",  "[গ] নদীর মোহনায়",  "[ঘ] সমুদ্রসৈকতে"},
            {"[ক] প্রকৃতির স্থায়িত্ব",  "[খ] প্রাণের অমরত্ব",  "[গ] প্রকৃতির নশ্বরতা",  "[ঘ] প্রাণের ক্ষণস্থায়িত্ব"},
            {"[ক] মানুষের গড়া সভ্যতা ধ্বংস হয়ে গেছে",  "[খ] প্রকৃতির কাছে মানুষ অসহায়",  "[গ] মানুষ চাইলে সবই সম্ভব",  "[ঘ] প্রকৃতি ক্ষণস্থায়ী হলেও জীবন অনন্ত"}


    };


    public static String myCorrectAnswer[] = {

            "[গ] জীবনানন্দ দাশ",
            "[ঘ] ১৮৯৯ সালে",
            "[গ] বরিশাল",
            "[খ] সত্যানন্দ দাশ",
            "[খ] কুসুমকুমারী দাশ",
            "[গ] স্বভাব কবি",
            "[খ] ব্রজমোহন স্কুল",
            "[ক] ব্রজমোহন কলেজ",
            "[গ] প্রেসিডেন্সি কলেজ",
            "[ঘ] ১৯২১ সালে",
            "[গ] কলকাতা বিশ্ববিদ্যালয়",
            "[খ] ইংরেজি",
            "[খ] অধ্যাপনা",
            "[গ] আধুনিক জীবনচেতনার কবি",
            "[খ] বাংলার প্রকৃতির রূপ প্রত্যক্ষকরণে",
            "[ঘ] বাংলার প্রকৃতি",
            "[গ] মহাপৃথিবী",
            "[ক] সাতটি তারার তিমির",
            "[গ] ট্রাম দুর্ঘটনা",
            "[ঘ] ১৯৫৪ সালে",
            "[গ] ২২ শে অক্টোবর ১৯৫৪",
            "[ক] এই মাঠ",
            "[খ] নদীর",
            "[গ] সোনার স্বপ্নের সাধ",
            "[গ] চলতা ফুল",
            "[খ] সঙ্গীনির তরে",
            "[ক] শান্ত বাতি",
            "[খ] চরের কাছে",
            "[ক] প্রকৃতির স্থায়িত্ব",
            "[ক] মানুষের গড়া সভ্যতা ধ্বংস হয়ে গেছে"


    };








}
