package com.soft.mcqbanglabook;

public class ShikkaO_MonosottoQNA {





    public static String myQuestion[] ={
            "১. ‘মোতাহের হোসেন চৌধুরী কত সালে জন্মগ্রহণ করেন?",
            "২. মোতাহের হোসেন চৌধুরীর জন্মস্থান কোথায়?",
            "৩. মোতাহের হোসেন চৌধুরীর পৈতৃক নিবাস কোন জেলায়?",
            "৪. মোতাহের হোসেন চৌধুরী কত সালে এম.এ. পাস করেন?",
            "৫. মোতাহের হোসেন চৌধুরী কোন বিশ্ববিদ্যালয় থেকে এম.এ পাস করেন?",
            "৬. মোতাহের হোসেন চৌধুরী কোন বিষয়ে এম.এ পাস করেন?",
            "৭. কর্মজীবনে মোতাহের হোসেন চৌধুরী কিসের অধ্যাপক ছিলেন?",
            "৮. মোতাহের হোসেন চৌধুরী কোন পত্রিকার সাথে সম্পৃক্ত ছিলেন?",
            "৯. ‘শিখা’ পত্রিকাটি কোথা থেকে প্রকাশিত হতো?",
            "১০. মোতাহের হোসেন চৌধুরীর লেখায় কিসের স্বচ্ছন্দ প্রকাশ ঘটেছে?",
            "১১. মোতাহের হোসেন চৌধুরীর গদ্যে কোন লেখকের প্রভাব লক্ষণীয়?",
            "১২. মোতাহের হোসেন চৌধুরী মূলত কোনটি ছিলেন?",
            "১৩. কোনটি মোতাহের হোসেন চৌধুরী রচিত প্রবন্ধগ্রন্থ?",
            "১৪. কোনটি মোতাহের হোসেন চৌধুরী রচিত অনুবাদগ্রন্থ?",
            "১৫. মোতাহের হোসেন চৌধুরী কত সালে মৃত্যুবরণ করেন?",
            "১৬. শিক্ষা ও মনুষ্যত্ব প্রবন্ধে মানবজীবনকে কয়তলাবিশিষ্ট ঘরের সাথে তুলনা করা হয়েছে?",
            "১৭. মানবজীবনকে দোতলা ঘর হিসেবে তুলনা করলে এর নিচতলার নাম কী হবে?",
            "১৮. মানবজীবনকে দোতলা ঘরের সাথে তুলনা করা হলে এর ওপরের তলা কোনটি?",
            "১৯. জীবসত্তার ঘর থেকে মানবসত্তার ঘরে ওঠার মই কী?",
            "২০. ক্ষুৎপিপাসার বিষয়টিকে কেমন করে তোলা শিক্ষার অন্যতম কাজ?",
            "২১. শিক্ষার আসল কাজ কী?",
            "২২. মানুষকে কিসের সাথে পরিচয় করিয়ে দেওয়া শিক্ষার প্রকৃত উদ্দেশ্য?",
            "২৩. শিক্ষার শ্রেষ্ঠ দিক কোনটি?",
            "২৪. মানবজীবনের নিচের তলায় বিশৃঙ্খল অবস্থার কারণে কী ঘটে?",
            "২৫. সকলে কিসের নিগড়ে বন্দি?",
            "২৬. চাই, চাই, আরও চাই- সকলের এ চাহিদা কিসের?",
            "২৭. কোনটি ভালোভাবে বুঝতে না পারলে শিক্ষা আমাদের জন্য কোনো সুফল বয়ে আনবে না?",
            "২৮. অর্থসাধনাই জীবনসাধনা নয়- এটি মানুষকে বোঝাতে না পারলে শিক্ষার সুফল কী হবে?",
            "২৯. ‘শিক্ষা ও মনুষ্যত্ব’ প্রবন্ধের লেখক অন্নচিন্তার নিগড় থেকে মানুষকে মুক্তি দেওয়ার চেষ্টাকে কী বলেছেন?",
            "৩০. কোনটি পেলে আলো-হাওয়ার স্বাদবঞ্চিত মানুষ কারাগারকেই স্বর্গতুল্য মনে করে?"



    };


    public static String myChoices[][] = {
            {"ক. ১৯০১ সালে",  "খ. ১৯০২ সালে",  "গ. ১৯০৩ সালে",  "ঘ. ১৯০৪ সালে"},
            {"ক. কুমিল্লা",  "খ. ঢাকা",  " গ. কলকাতা",  "ঘ. হুগলি"},
            {"ক. কুমিল্লা",  "খ. চাঁদপুর",  "গ. ফেনী",  "ঘ. নোয়াখালী "},
            {"ক. ১৯৪০ সালে",  "খ. ১৯৪৩ সালে",  "গ. ১৯৪৫ সালে",  "ঘ. ১৯৪৮ সালে"},
            {"ক. চট্টগ্রাম বিশ্ববিদ্যালয়",  "খ. রাজশাহী বিশ্ববিদ্যালয়",  "গ. ঢাকা বিশ্ববিদ্যালয়",  "ঘ. খুলনা বিশ্ববিদ্যালয়"},
            {"ক. বাংলা ",  "খ. ইংরেজি",  "গ. দর্শন",  "ঘ. ভাষাতত্ত্ব"},
            {"ক. দর্শনের",  "খ. ইংরেজি ভাষা ও সাহিত্যের",  "গ. ভাষাতত্ত্বের",  "ঘ. বাংলা ভাষা ও সাহিত্যের "},
            {"ক. নবযুগ",  "খ. সবুজপত্র",  "গ. লাঙল",  "ঘ. শিখা "},
            {"ক. কুমিল্লা থেকে",  "খ. কলকাতা থেকে",  "গ. ঢাকা থেকে",  "ঘ. চট্টগ্রাম থেকে"},
            {"ক. ধর্মনিরপেক্ষতা ও সমাজনীতির",  "খ. রাজনীতি ও অর্থনীতির",  "গ. মননশীলতা ও চিন্তার ",  "ঘ. সাম্প্রদায়িকতা ও শ্রেণিভাবনার"},
            {"ক. রবীন্দ্রনাথ ঠাকুর",  "খ. হুমায়ুন আজাদ",  "গ. প্রমথ চৌধুরী",  "ঘ. কাজী নজরুল ইসলাম"},
            {"ক. গদ্যকার ",  "খ. ছড়াকার",  "গ. নাট্যকার",  "ঘ. সুরকার"},
            {"ক. রায়তের কথা",  "খ. প্রবন্ধ সংগ্রহ",  "গ. সংস্কৃতি কথা ",  "ঘ. স্বগত সংলাপ"},
            {" ক. সভ্যতা",  "খ. বাক্যতত্ত্ব",  "গ. নীললোহিত",  "ঘ. যাত্রাবদল"},
            {"ক. ১৯৫১ সালে",  "খ. ১৯৫৩ সালে",  "গ. ১৯৫৬ সালে",  "ঘ. ১৯৫৯ সালে"},
            {"ক. দোতলা ",  "খ. তিনতলা",  "গ. চারতলা",  "ঘ. পাঁচতলা"},
            {"ক. মানবসত্তা",  "খ. মূল্যবোধ",  "গ. জীবসত্তা ",  "ঘ. স্বাধীনতা"},
            {"ক. জীবসত্তা",  "খ. ক্ষুৎপিপাসা",  "গ. মানবসত্তা",  " ঘ. মৌলিক অধিকার"},
            {"ক. অর্থ",  "খ. খাদ্য",  "গ. শিক্ষা",  "ঘ. চিকিৎসা"},
            {"ক. অমানবিক",  "খ. অপ্রয়োজনীয়",  "গ. মানবিক",  "ঘ. সহজলভ্য"},
            {"ক. জীবসত্তার পরিচয় চেনানো",  "খ. ক্ষুৎপিপাসা নিবারণ করা",  " গ. মানবসত্তার ঘর বন্ধ রাখা",  "ঘ. মনুষ্যত্বের বিকাশ ঘটানো"},
            {"ক. ক্ষুৎপিপাসার সাথে",  "খ. মনুষ্যত্বের সাথে ",  "গ. স্বর্গলোকের সাথে",  "ঘ. অর্থ-বিত্তের সাথে"},
            {"ক. প্রয়োজনের দিক",  "খ. অপ্রয়োজনের দিক",  "গ. অর্থ উপার্জনের দিক",  "ঘ. ব্যবহারিক দিক"},
            {"ক. শিক্ষার অপ্রয়োজনের দিকটি মুখ্য হয়ে ওঠে",  "খ. শিক্ষার প্রয়োজনের দিকটি মুখ্য হয়ে ওঠে",  "গ. শিক্ষার আসল কাজটি সুসম্পন্ন হয়",  "ঘ. শিক্ষা মানবজীবনে সোনা ফলায়"},
            {"ক. ধর্মচিন্তার নিগড়ে",  "খ. সমাজচিন্তার নিগড়ে",  "গ. অর্থচিন্তার নিগড়ে",  "ঘ. রাষ্ট্রচিন্তার নিগড়ে"},
            {"ক. অর্থের",  "খ. শিক্ষার",  "গ. চিকিৎসার",  "ঘ. নিরাপত্তায়"},
            {"ক. মনুষত্ব্যের সাধনাই জীবনসাধনা নয়",  "খ. শিক্ষা ছাড়াও জীবন গড়া যায়",  "গ. অর্থসাধনাই জীবনসাধনা নয় ",  "ঘ. অন্নচিন্তা জীবনের শ্রেষ্ঠ চিন্তা"},
            {"ক. সামগ্রিক",  "খ. সহজলভ্য",  "গ. ব্যক্তিগত ",  "ঘ. বস্তুগত"},
            {"ক. নিন্দনীয়",  "খ. অপ্রয়োজনীয়",  "গ. প্রশংসনীয়",  "ঘ. শোচনীয়"},
            {"ক. প্রচুর শিক্ষা উপকরণ",  "খ. অঢেল অন্ন-বস্ত্র",  "গ. উন্নত বিনোদন ব্যবস্থা",  "ঘ. পর্যাপ্ত টাকা পয়সা"}


    };



    public static String myCorrectAnswer[] = {
            "গ. ১৯০৩ সালে",
            "ক. কুমিল্লা",
            "ঘ. নোয়াখালী ",
            "খ. ১৯৪৩ সালে",
            "গ. ঢাকা বিশ্ববিদ্যালয়",
            "ক. বাংলা ",
            "ঘ. বাংলা ভাষা ও সাহিত্যের ",
            "ঘ. শিখা ",
            "গ. ঢাকা থেকে",
            "গ. মননশীলতা ও চিন্তার ",
            "গ. প্রমথ চৌধুরী",
            "ক. গদ্যকার ",
            "গ. সংস্কৃতি কথা ",
            " ক. সভ্যতা",
            "গ. ১৯৫৬ সালে",
            "ক. দোতলা ",
            "গ. জীবসত্তা ",
            "গ. মানবসত্তা",
            "গ. শিক্ষা",
            "গ. মানবিক",
            "ঘ. মনুষ্যত্বের বিকাশ ঘটানো",
            "খ. মনুষ্যত্বের সাথে ",
            "খ. অপ্রয়োজনের দিক",
            "খ. শিক্ষার প্রয়োজনের দিকটি মুখ্য হয়ে ওঠে",
            "গ. অর্থচিন্তার নিগড়ে",
            "ক. অর্থের",
            "গ. অর্থসাধনাই জীবনসাধনা নয় ",
            "গ. ব্যক্তিগত ",
            "গ. প্রশংসনীয়",
            "খ. অঢেল অন্ন-বস্ত্র"


    };












}
