package com.soft.mcqbanglabook;

public class ShuvaGolpo {



    public static String question[] ={
            "১. রবীন্দ্রনাথ ঠাকুর কত খ্রিষ্টাব্দে জন্মগ্রহণ করেন?",
            "২. রবীন্দ্রনাথ ঠাকুর কত বঙ্গাব্দে জন্মগ্রহণ গ্রহণ করেন?",
            "৩. কোনগুলো রবীন্দ্রনাথ ঠাকুরের কাব্যগ্রন্থ?",
            "৪. বিশ্বকবি রবীন্দ্রনাথ ঠাকুরের পিতার নাম কী?",
            "৫. রবীন্দ্রনাথ ঠাকুর কোন কাব্যের জন্য নোবেল পুরস্কার পান?",
            "৬. এশীয়দের মধ্যে সাহিত্যে সর্বপ্রম নোবেল পুরস্কার পান কে?",
            "৭. “তিনি একাধারে সাহিত্যিক, দার্শনিক ও শিক্ষাবিদ।” উক্তিটি কোন লেখক সম্পর্কে প্রযোজ্য?",
            "৮. ‘বিসর্জন’ ও ‘রক্তকরবী’র মধ্যে মিল কিসে?",
            "৯. রবীন্দ্রনাথ ঠাকুরের সাথে ৭ই মে ও ৭ই আগস্ট কীভাবে সম্পর্কিত?",
            "১০. রবীন্দ্রনাথ ঠাকুর কত খ্রিষ্টাব্দে মৃত্যুবরণ করেন?",
            "১১. রবীন্দ্রনাথ ঠাকুর শেষ নিশ্বাস ত্যাগ করেন",
            "১২. সুভার ওষ্ঠাধর ভাবের আভাসমাত্র কিসের মতো কেঁপে উঠত?",
            "১৩. “তখন কে জানিত সে বোবা হইবে?” এখানে কার কথা বলা হয়েছে?",
            "১৪. সুভাষিণীরা কয় বোন?",
            "১৫. সুভাষিণীর নাম কে রাখেন?",
            "১৬. সুভাষিণীর বাবা কিসের ভিত্তিতে ছোট মেয়েটির নাম রাখেন সুভাষিণী?",
            "১৭. ‘সুভাষিণী’ অর্থ কী?",
            "১৮. সুভাষিণীকে সবাই সংক্ষেপে কী নামে ডাকে?",
            "১৯. সুকেশিনী ও সুহাসিনীর সাথে সুভাষিণীর সম্পর্ক কী?",
            "২০. দস্তুরমতো অনুসন্ধান ও অর্থব্যয়ে কাদের বিয়ে হয়ে গেছে?",
            "২১. “এখন ছোটোটি পিতামাতার নীরব হৃদয়ভারের মতো বিরাজ করিতেছে।” এখানে ‘ছোটোটি’ বলতে কাকে বোঝানো হয়েছে?",
            "২২. ‘সে কথা বলতে পারে না’ এখানে যাকে নির্দেশ করা যায়",
            "২৩. কার সাক্ষাতেই সবাই তার ভবিষ্যৎ সম্পর্কে দুশ্চিন্তা প্রকাশ করে?",
            "২৪. ‘এইজন্য তাহার সাক্ষাতেই সকলে তাহার ভবিষ্যৎ সম্বন্ধে দুশ্চিন্তা প্রকাশ করিত’- দুশ্চিন্তা প্রকাশের কারণ কী?",
            "২৫. কে বুঝেছে যে সে বিধাতার অভিশাপরূপে জন্মগ্রহণ করেছে?",
            "২৬.  সুদীর্ঘ পল্লববিশিষ্ট বলতে ‘সুভা’ গল্পে কী নির্দেশিত হয়েছে? ",
            "২৭ ‘সুভা’ গল্পের অন্তর্নিহিত তাৎপর্য কোনটি? ",
            "২৮. ‘সুভা’ গল্পের সুভা কোন ধরনের প্রতিবন্ধী? ",
            "২৯. সুভা কোথায় মুক্তির আনন্দ খুঁজে পায়? ",
            "৩০. ‘শেষের কবিতা’ কোন প্রকৃতির রচনা?"

    };

    public static String choices[][] = {

            {" ক ১৮৫১ খ্রিষ্টাব্দে",  " খ. ১৮৬১ খ্রিষ্টাব্দে",  " গ ১৮৭১ খ্রিষ্টাব্দে",  " ঘ ১৮৮১ খ্রিষ্টাব্দে"},
            {" ক ১২৬১",  " খ. ১২৬২",  " গ. ১২৬৮",  " ঘ ১২৭২"},
            {" ক মানসী, সোনার তরী, চিত্রা, বিসর্জন",  " খ ক্ষণিকা, বলাকা, পুনশ্চ, শেষের কবিতা",  " গ রক্তকরবী, চোখের বালি, কল্পনা, চিত্রা",  " ঘ. চিত্রা, কল্পনা, সোনার তরী, মানসী"},
            {" ক. প্রিন্স দ্বারকানাথ ঠাকুর",  " খ. মহর্ষি দেবেন্দ্রনাথ ঠাকুর",  " গ. অবনীন্দ্রনাথ ঠাকুর",  " ঘ. সুরেন্দ্রনাথ ঠাকুর"},
            {" ক ক্ষণিকা",  " খ মানসী",  " গ সোনার তরী",  " ঘ. গীতাঞ্জলি"},
            {" ক কেনজাবুরো ওয়ে",  " খ. রবীন্দ্রনাথ ঠাকুর",  " গ. নাগিব মাহফুজ",  " ঘ. অরহান পামুক"},
            {" ক প্রমথ চৌধুরী",  " খ. রবীন্দ্রনাথ ঠাকুর",  " গ. বঙ্কিমচন্দ্র চট্টোপাধ্যায়",  " ঘ. মুহম্মদ শহীদুল্লাহ"},
            {" ক. দুটিই রবীন্দ্রনাথ ঠাকুরের নাটক",  " খ. দুটিই রবীন্দ্রনাথ ঠাকুরের উপন্যাস",  " গ. আঙ্গিক ভিনড়ব হলেও দুটির বিষয়বস্তু অভিনড়ব",  " ঘ. দুটিই প্রকাশিত হয়েছে রবীন্দ্রনাথের মৃত্যুর পরে"},
            {" ক. জন্ম ও মৃত্যুতে",  " খ. জন্ম ও বিবাহে",  " গ. মৃত্যু ও নোবেল প্রাপ্তিতে",  " ঘ. নোবেল ও জমিদারি পত্তনে"},
            {" ক. ১৯৪১ খ্রিষ্টাব্দে",  " খ. ১৯৩৮ খ্রিষ্টাব্দে",  " গ. ১৯৪০ খ্রিষ্টাব্দে",  " ঘ. ১৯৪২ খ্রিষ্টাব্দে"},
            {" ক. কলকাতায়",  " খ. শান্তিনিকেতনে",  " গ. উড়িষ্যায়",  " ঘ. ব্রিটেনে"},
            {" ক. হরিণের মতো",  " খ. কচি কিশলয়ের মতো",  " গ. নির্জীবের মতো",  " ঘ. অসহায়ের মতো"},
            {" ক. সুভাষিণীর",  " খ সুকেশিনীর",  " গ সুহাসিনীর",  " ঘ সুনয়নার"},
            {" ক. তিন",  " খ. চার",  " গ. পাঁচ",  " ঘ. ছয়"},
            {" ক. তার মা",  " খ. সুভাষিণীর বাবা",  " গ. তার বড় বোন",  " ঘ. তার মামা"},
            {" ক. নিজের নামের ভিত্তিতে",  " খ. অন্যের কথায়",  " গ. প্রতিবেশীর কথায়",  " ঘ. বড় দুই মেয়ের নামের ভিত্তিতে"},
            {" ক. মধুরভাষী",  " খ. সুন্দর মুখ",  " গ. উজ্জ্বল",  " ঘ. সুন্দর কথা"},
            {" ক. সুভাষী",  " খ. ভাষিণ",  " গ. সুভা",  " ঘ. সুণী"},
            {" ক. বোন",  " খ. বান্ধবী",  " গ. খালাতো বোন",  " ঘ. চাচাতো বোন"},
            {" ক. সুভার",  " খ. সুভার বোনদের",  " গ. সুভার বান্ধবীর",  " ঘ. প্রতাপের"},
            {" ক. সুকেশিনীকে",  " খ. সুহাসিনীকে",  " গ. সুনয়নাকে",  " ঘ. সুভাষিণীকে"},
            {" ক. সুকেশিনীকে",  " খ. সুহাসিনীকে",  " গ. সুভাষিণীকে",  " ঘ. প্রতাপকে"},
            {" ক. প্রতাপের",  " খ. সুভার",  " গ. সুহাসিনীর",  " ঘ. সুকেশিনীর"},
            {" ক সুভা জেদি",  " খ. সুভা বোবা",  " গ. সুভা অন্ধ",  " ঘ. সুভা কালো"},
            {" ক. প্রতাপ",  " খ. সুভার মা",  " গ. সুভা",  " ঘ. সুভার বোন"},
            {" ক. অনেক পাতাবিশিষ্ট বই",  " খ. অনেক পাতাবিশিষ্ট খাতা",  " গ. লম্বা পাতাবিশিষ্ট গাছ",  " ঘ. বড় পাতাবিশিষ্ট চোখ"},
            {" ক. প্রতিবন্ধী সন্তানের প্রতি সহানুভূতি",  " খ. দরিদ্র সন্তানের প্রতি সহানুভূতি",  " গ. দুরন্ত সন্তানের প্রতি সহানুভূতি",  " ঘ. অবাধ্য সন্তানের প্রতি সহানুভূতি"},
            {" ক. শ্রবণপ্রতিবন্ধী",  " খ. দৃষ্টিপ্রতিবন্ধী",  " গ. বাক্প্রতিবন্ধী",  " ঘ. বুদ্ধিপ্রতিবন্ধী"},
            {" ক. প্রতাপের কাছে ",  " খ. প্রকৃতির কাছে",  " গ. বাবার কাছে ",  " ঘ. মায়ের কাছে"},
            {" ক. কাব্যগ্রন্থ",  " খ. উপন্যাস",  " গ. প্রবন্ধ",  " ঘ. ছোটগল্প"}


    };

    public static String correctAnswers[] = {
            " খ. ১৮৬১ খ্রিষ্টাব্দে",
            " গ. ১২৬৮",
            " ঘ. চিত্রা, কল্পনা, সোনার তরী, মানসী",
            " খ. মহর্ষি দেবেন্দ্রনাথ ঠাকুর",
            " ঘ. গীতাঞ্জলি",
            " খ. রবীন্দ্রনাথ ঠাকুর",
            " খ. রবীন্দ্রনাথ ঠাকুর",
            " ক. দুটিই রবীন্দ্রনাথ ঠাকুরের নাটক",
            " ক. জন্ম ও মৃত্যুতে",
            " ক. ১৯৪১ খ্রিষ্টাব্দে",
            " খ. শান্তিনিকেতনে",
            " খ. কচি কিশলয়ের মতো",
            " ক. সুভাষিণীর",
            " ক. তিন",
            " খ. সুভাষিণীর বাবা",
            " ঘ. বড় দুই মেয়ের নামের ভিত্তিতে",
            " ক. মধুরভাষী",
            " গ. সুভা",
            " ক. বোন",
            " খ. সুভার বোনদের",
            " ঘ. সুভাষিণীকে",
            " গ. সুভাষিণীকে",
            " খ. সুভার",
            " খ. সুভা বোবা",
            " গ. সুভা",
            " ঘ. বড় পাতাবিশিষ্ট চোখ",
            " ক. প্রতিবন্ধী সন্তানের প্রতি সহানুভূতি",
            " গ. বাক্প্রতিবন্ধী",
            " খ. প্রকৃতির কাছে",
            " খ. উপন্যাস"

    };



}
