package com.soft.mcqbanglabook;

public class TomakePawerJonnoQNA {



    public static String myQuestion[] ={
            "১. শামসুর রাহমান কত সালে জন্মগ্রহণ করেন? ",
            "২. শামসুর রাহমানের জন্মতারিখ কোনটি?",
            "৩. শামসুর রাহমানের জন্মস্থান কোনটি? ",
            "৪. শামসুর রাহমানের পৈতৃক নিবাস কোথায়?",
            "৫. শামসুর রাহমানের গ্রামের নাম কী?",
            "৬. শামসুর রাহমানের বাবার নাম কোনটি?",
            "৭. শামসুর রাহমানের মায়ের নাম কী?",
            "৮. শামসুর রাহমান কত সালে ম্যাট্রিক পাস করেন?",
            "৯. শামসুর রাহমান কত সালে ইন্টারমিডিয়েট পাস করেন? ",
            "১০. শামসুর রাহমান কোন স্কুল থেকে ম্যাট্রিক পাস করেন?",
            "১১. শামসুর রাহমান কোথা থেকে স্নাতক ডিগ্রি লাভ করেন? ",
            "১২. শামসুর রাহমানের কাব্যগ্রন্থ কোনটি ছিল?",
            "১৩. শামসুর রাহমান কোন কাজে একনিষ্ঠভাবে নিয়োজিত ছিলেন? ",
            "১৪. কাদের জীবনের আশা-আকাক্সক্ষা হতাশার কথা শামসুর রাহমানের কবিতায় সার্থকভাবে বিধৃত হয়েছে?",
            "১৫. শামসুর রাহমানের কবিতায় কোন ধরনের কাব্যধারার বৈশিষ্ট্য সার্থকভাবে প্রকাশিত হয়েছে?",
            "১৬. কবিতায় উপমা ও চিত্রকল্প ব্যবহারে শামসুর রাহমান কোনটিকে অবলম্বন করেছেন?",
            "১৭. কোনটি শামসুর রাহমানের অন্যতম কাব্যগ্রন্থ?",
            "১৮. নিচের কোনটি শামসুর রাহমানের উল্লেখযোগ্য কাব্যগ্রন্থ?",
            "১৯. শামসুর রাহমানের মৃত্যুতারিখ কোনটি? ",
            "২০. স্বাধীনতা আসবে বলে কার কপাল ভাঙল?",
            "২১. শহরের বুকে কোন রঙের ট্যাঙ্ক এলো? ",
            "২২. জলপাই রঙের ট্যাঙ্ক কিসের মতো চিৎকার করতে করতে শহরে এলো?",
            "২৩. কোনগুলো যত্রতত্র খই ফোটাল?",
            "২৪. রিকয়েললেস রাইফেল আর মেশিনগান খই ফোটাল যত্রতত্র- এখানে কিসের চিত্র প্রকাশিত হয়েছে?",
            "২৫. কার সিঁথির সিঁদুর মুছে গেল? ",
            "২৬. স্বাধীনতা আসবে বলে কোনটি ছাই হয়ে গেল?",
            "২৭. স্বাধীনতা আসবে বলে প্রভুর বাস্তুভিটার ভগ্নস্তূপে দাঁড়িয়ে কে আর্তনাদ করল?",
            "২৮. অবুঝ শিশু কিসের ওপর হামাগুড়ি দিল? ",
            "২৯. ‘তোমাকে পাওয়ার জন্যে, হে স্বাধীনতা’ কবিতায় কার পিতামাতা হানাদারদের হত্যাযজ্ঞের শিকার হয়েছে?",
            "৩০. স্বাধীনতার প্রতীক্ষায় থুত্থুরে বুড়ো কোথায় বসে আছেন?"



    };

    public static String myChoices[][] = {

            {"[ক] ১৯১৯ সালে",  "[খ] ১৯২৫ সালে",  "[গ] ১৯২৯ সালে",  "[ঘ] ১৯৩৫ সালে"},
            {"[ক] ১৯শে আগস্ট ১৯১৯",  "[খ] ২৪শে অক্টোবর ১৯১৯",  "[গ] ২৯শে আগস্ট ১৯২৯",  "[ঘ] ২৪শে অক্টোবর ১৯২৯"},
            {"[ক] ঢাকা",  "[খ] নরসিংদী",  "[গ] চট্টগ্রাম",  "[ঘ] মানিকগঞ্জ"},
            {"[ক] ঢাকা জেলায়",  "[খ] নরসিংদী জেলায়",  "[গ] মানিকগঞ্জ জেলায়",  "[ঘ] মুন্সিগঞ্জ জেলায়"},
            {"[ক] কাশবন",  "[খ] বিজয়করা",  "[গ] পাড়াতলী",  "[ঘ] মাঝআইল"},
            {"[ক] মাহমুদুর রহমান",  "[খ] মোস্তাফিজুর রহমান",  "[গ] মোখলেসুর রহমান",  "[ঘ] মাসুদুর রহমান"},
            {"[ক] সালমা বেগম",  "[খ] আমেনা খাতুন",  "[গ] রহিমা খাতুন",  "[ঘ] সালেহা বেগম"},
            {"[ক] ১৯২৯ সালে",  "[খ] ১৯৩৫ সালে",  "[গ] ১৯৩৯ সালে",  "[ঘ] ১৯৪৫ সালে"},
            {"[ক] ১৯২৭ সালে",  "[খ] ১৯২৯ সালে",  "[গ] ১৯৩৯ সালে",  "[ঘ] ১৯৪৭ সালে"},
            {"[ক] রেসিডেনসিয়াল মডেল স্কুল",  "[খ] কলেজিয়েট স্কুল",  "[গ] পোগোজ স্কুল",  "[ঘ] আইডিয়াল স্কুল"},
            {"[ক] ঢাকা বিশ্ববিদ্যালয় থেকে",  "[খ] জাহাঙ্গীরনগর বিশ্ববিদ্যালয় থেকে",  "[গ] চট্টগ্রাম বিশ্ববিদ্যালয় থেকে",  "[ঘ] রাজশাহী বিশ্ববিদ্যালয় থেকে"},
            {"[ক] এই পথ এই কোলাহল",  "[খ] প্রেমাংশুর রক্ত চাই",  "[গ] গৃহযুদ্ধের আগে",  "[ঘ] নূরুলদীনের সারাজীবন"},
            {"[ক] কাব্য সাধনায়",  "[খ] শিক্ষকতায়",  "[গ] বিজ্ঞান গবেষণায়",  "[ঘ] মানবসেবায়"},
            {"[ক] উচ্চবিত্তদের",  "[খ] মধ্যবিত্তদের",  "[গ] নিম্নবিত্তদের",  "[ঘ] উচ্চ মধ্যবিত্তদের"},
            {"[ক] প্রাচীন কাব্যধারার",  "[খ] মধ্যযুগীয় কাব্যধারার",  "[গ] আধুনিক কাব্যধারার",  "[ঘ] অতি আধুনিক কাব্যধারা"},
            {"[ক] বিজ্ঞান",  "[খ] শহর",  "[গ] প্রকৃতি",  "[ঘ] মানুষ"},
            {"[ক] মানব হৃদয়ে নৈবেদ্য সাজাই",  "[খ] বৈশাখে রচিত পঙ্ক্তিমালা",  "[গ] প্রেমাংশুর রক্ত চাই",  "[ঘ] এসেছি নিজের ভোরে"},
            {"[ক] বাংলার মাটি বাংলার জল",  "[খ] বুক তার বাংলাদেশের হৃদয়",  "[গ] অগ্নি ও জলের কবিতা",  "[ঘ] মিছিলের সমান বয়সী"},
            {"[ক] ১৭ই আগস্ট ২০০৪",  "[খ] ২৪শে অক্টোবর ২০০৪",  "[গ] ১৭ই আগস্ট ২০০৬",  "[ঘ] ২৪শে অক্টোবর ২০০৬"},
            {"[ক] হরিদাসীর",  "[খ] সাকিনা বিবির",  "[গ] অনাথ কিশোরীর",  "[ঘ] মোল্লাবাড়ির বিধবার"},
            {"[ক] কালো",  "[খ] হলুদ",  "[গ] জলপাই",  "[ঘ] জাম"},
            {"[ক] হাতির মতো",  "[খ] সিংহের মতো",  "[গ] দানবের মতো",  "[ঘ] উন্মত্তের মতো"},
            {"[ক] রাইফেল, মেশিনগান",  "[খ] পিস্তল, গ্রেনেড",  "[গ] স্টেনগান, কামান",  "[ঘ] হাতবোমা, রকেট লাঞ্চার"},
            {"[ক] নির্মম হত্যাযজ্ঞের",  "[খ] সম্মিলিত প্রতিরোধের",  "[গ] সামরিক অনুশীলনের",  "[ঘ] আগ্নেয়াস্ত্রের সহজলভ্যতার"},
            {"[ক] সুমতির",  "[খ] রেণুমালার",  "[গ] হরিদাসীর",  "[ঘ] অঞ্জলীর"},
            {"[ক] শহরের পর শহর",  "[খ] গ্রামের পর গ্রাম",  "[গ] বনের পর বন",  "[ঘ] মাঠের পর মাঠ"},
            {"[ক] ঘোড়া",  "[খ] কুকুর",  "[গ] বিড়াল",  "[ঘ] হাতি"},
            {"[ক] বাস্তুভিটার ভগ্নস্তূপের ওপর",  "[খ] জলপাই রঙের ট্যাঙ্কের ওপর",  "[গ] নতুন নিশানের ওপর",  "[ঘ] পিতামাতার লাশের ওপর"},
            {"[ক] হরিদাসীর",  "[খ] অবুঝ শিশুর",  "[গ] থুত্থুরে বুড়োর",  "[ঘ] রুস্তম শেখের"},
            {"[ক] বৃদ্ধাশ্রমে",  "[খ] পথের ধারে",  "[গ] ঘরের দাওয়ায়",  "[ঘ] বিধ্বস্ত বাস্তুভিটায়"}


    };
    public static String myCorrectAnswer[] = {

            "[গ] ১৯২৯ সালে",
            "[ঘ] ২৪শে অক্টোবর ১৯২৯",
            "[ক] ঢাকা",
            "[খ] নরসিংদী জেলায়",
            "[গ] পাড়াতলী",
            "[গ] মোখলেসুর রহমান",
            "[খ] আমেনা খাতুন",
            "[ঘ] ১৯৪৫ সালে",
            "[ঘ] ১৯৪৭ সালে",
            "[গ] পোগোজ স্কুল",
            "[ক] ঢাকা বিশ্ববিদ্যালয় থেকে",
            "[খ] প্রেমাংশুর রক্ত চাই",
            "[ক] কাব্য সাধনায়",
            "[খ] মধ্যবিত্তদের",
            "[ঘ] অতি আধুনিক কাব্যধারা",
            "[গ] প্রকৃতি",
            "[ক] মানব হৃদয়ে নৈবেদ্য সাজাই",
            "[খ] বুক তার বাংলাদেশের হৃদয়",
            "[গ] ১৭ই আগস্ট ২০০৬",
            "[খ] সাকিনা বিবির",
            "[গ] জলপাই",
            "[গ] দানবের মতো",
            "[ক] রাইফেল, মেশিনগান",
            "[ক] নির্মম হত্যাযজ্ঞের",
            "[গ] হরিদাসীর",
            "[খ] গ্রামের পর গ্রাম",
            "[খ] কুকুর",
            "[ঘ] পিতামাতার লাশের ওপর",
            "[খ] অবুঝ শিশুর",
            "[গ] ঘরের দাওয়ায়"



    };




}
